{"give": ["Anyone who needs #Remdisivir in #Patnacovid please contact MR Amith(Sadar hospital manager) his contact number is 7004017676. ( verified today)", "@NZinIndia Do you have some cases in your Embassy ? For which you need Oxygen , pl clarify .", "Verified Information 1st May 1:30 pm   4 oxyzen beds available at  Zenith hospital, Nagpur  For contact details please DM  #Nagpur #NagpurSOS #COVID19India", "@TarakFanatic Contact below details kiran  Any one affected from covid-19 needs in blr *Bed* *ICU Bed* *Oxygen Cylinders* *Oxygen Concentrate* can inform me. I am part of Yuva Raksha from M P TEJASVI SURYA office as volunteer indirectly. R.C.Kantharaj  *+91 98860 67078* *+91 93416 67078*", "An oxygen plant in Faridabad is filling cylinders for Rs 240. Abundant oxygen, no waiting, filling 1000 cylinders at once! Amplify for those looking for #oxygen in Delhi NCR. Location:  https://t.co/W8HuCmdidA  #CovidHelp #COVID19  #OxygenEmergency", "#Indore Oxygen beds available  Manpur Hospital Indore  #Verified at 11:05 Am #oxygenbeds", "@sandyvis Could you try this  250 #Oxygen #Beds would be available with #Hospital facility at   Gurdwara Shri Rakab Ganj Sahib #Delhi near Parliament House from 11am on 2 May'21. Ph- 011-23712581.", "For beds and Hospital info in Andhra Pradesh!  #Covid #AndhraPradesh    https://t.co/PxJOPEBE8t", "@preetibose26 Oxygen vendors for Banglore. All are verified today.   Contacts  1. Drug Controller Helpline 24x7 8951755722  2. Ganesh 9686198986  3. Manoj 9892356727  4. Ramesh 9844276111  5. Srikanth V 8861572742  6. Contact: Universal Air Products Subhashish Guha Roy 9845063119", "@AnandKu50934469 @RajuBistaBJP @ShankarGhoshBJP Viswa Bangla Krirangan Covid hospital in Jalpaiguri had 50+ vacant beds yesterday. Please ask him to check. Also try out Neotia Getwel hospital, Siliguri.", "@Nikhil_S If your friend has it and it’s already used and then can I bring my friend over to use it as no hospital bed is there", "@vikyaditya @mla_sudhakar 8660856709 mercy mission  933045 3857 these people are helping with ventilator oxy etc.  What'sapp them if thye don't pick calls", "@KhushiSinghCho4 @rapidcovidtext Joshi Nursing home - Chamrajpet has ICU with oxygen beds if saturation level is 80 or more, without oxygen support. CT score should be 15. Above they they cant take as they dont have ventilator. Mobile - 9008260106 #Bengaluru *VERIFIED*", "#Oxygen can #Lucknow  - 091708 18858  Price Rs.2200 for 8-10 ktrs Can", "HOME OXYGEN CONCENTRATOR AVAILABLE IN BENGALURU. Contact details 👇🏼  #HomeOxygenConcentrator #Bengaluru #Bangalore #Covid192021  https://t.co/pGXz7jFsTp", "Telangana - Legend Hospital - Beds Availability ( Normal &amp; Oxygen ) Called &amp; verified at 1:44pm DM if need details.  ( COVID REPORT MANDATORY mentioning condition - stable / not stable , age , SpO2 levels )  https://t.co/7QfPNHvoJ7", "Thanks to IntroBot - the AI Community Manager | Getting #CovidIndia  resources like Bed, Oxygen, Vaccine is now possible over @WhatsApp. Just join and search for \"Oxygen Cylinders in Bangalore\" #FightAgainstCOVID19   https://t.co/fLKxEpQYmv", "@TheKoalaKoya KC General Malleswaram has 200 Covid beds and 100 ICU ventilators available if anyone needs. Contact - 080-23344022 This might help, please try.", "One eg: “Hello everyone, Any one affected from covid-19 needs emergency *  Bed  * ICU bed  can inform me I am currently working with Yuva Raksha from MP TEJASVI SURYA office as volunteer. NISHANTH M V CONTACT NO: 7022716799, 8073014218”", "29) *SAGAR HOSPITAL (JAYNAGAR) - KSHMA PATIL (9900551992)*  30) *APOLLO HOSPITAL (JAYNAGAR) - SATYA NARAYANA (99448679233)*  31) *ST. JOHNS HOSPITAL - ANUPAMA (9964056696)*  32) *B.G.S. GLOBAL - LAKSHMIKANT (9901357318)*", "Available - #Remdesivir in #Vizag for MRP price   Somanath Medicals, Maharanipeta, Vizag.   Please Carry Original Prescription with doctor stamp/letter head Copy of Positive Report, Patient Aadhar card, Attendent Aadhar card Hospital inpatient ID  Verified at 9:40 AM, today.", "@rahulkanwal @WhatsApp Just now one train reached Faridabad with Oxygen tankers, I hope this will solve the immediate requirements in Delhi NCR. #COVID19India #CovidIndia #OxygenExpress   https://t.co/dPcAlwCCSU", "@Abhishe76477613 @WasimJaffer14 @dc_dhanbad @rajsinhabjp @srinivasiyc Thanks for help. We did check Sadar Hospital. We have managed to get an Oxygen Bed in the meanwhile in Railway Hospital. However, We need Ventilator.", "@Neelabhshukla @ramlingamr Thanks Neelabh. This is Malathi Manipal Hospital. May I ask what your question was to the handle? The PIN Code on CoWIN is 560078.", "Spoke with the hospital  1. They have 10 tonne one cylinder that only one company can refill. (Peenya gas industrial company) they don't have stock and vehicle to transport it  2. Small cylinders they have sent for refilling to peenya  @BBMPCOMM @BBMPAdmn @CPBlr need ur attention", "#Karnataka #KarnatakaFightsCorona #Bangalore #bangalorecovid #Ambulances #COVIDEmergency #COVID #COVID19India #CovidIndia   Ambulance available in Karnataka", "https://t.co/VxRKRMAFp1 please check this if you're looking for a hospital bed in BLR. This should be helpful in letting you know where to call and go. BBMP is also looking into private hospitals beds so you will get that info here too.", "Oxygen Refill available tomorrow morning may 4. Only refill no cylinder. BANGALORE  Faisal +918050659195 And 9739638289 #OXYGEN #BANGALORE #REFILL #OXYGENREFILL VERIFIED 11:30 MAY 3  https://t.co/z5dd8Vg0UL", "High technology oxygen concentrator received in our college campus for corona positive pateint speedy recovery  https://t.co/Cd5ukVTBQu", "Hi everyone, my team and I are raising money for @actgrants to help tackle the shortage of oxygen supply.  The money we raise as a team will be matched by our company @getomnify. If you’d like to support us, please DM me.   You can PayPal (for int. residents) or GPay/Paytm. 💚  https://t.co/r4LxC4bqs1", "@Damayantispeaks @sayantansunnyg #Oxygen  Vendors for Bengaluru. All are Verified 03/05 by another volunteer. Contacts: 1. Drug Controller Helpline 24x7 8951755722 2. Ganesh 9686198986 3. Manoj 9892356727 4. Ramesh 9844276111 5. Srikanth V 8861572742", "@HenaNaaz4 @SonuSood @taapsee @ravishndtv @mrsfunnybones @ReallySwara @MukeshSharmaMLA #delhioxygen refill available Available tonight as well as tomorrow at Vinayak Oxygen Mayapuri B-93 Aadhar card and prescription required Contact- +91 98688 27510 There will be rush, so one has to stand in the queue foor 2,3 hrs ..", "@RK_Hebbar @RohitMath @Tejasvi_Surya @drashwathcn @mla_sudhakar @BJP4Udupi Check with Manipal hospital, Malleswaram", "@KicchaSudeep\"boss ಪ್ರತಿ ಜೀವ ನಮಗೆ ಮುಖ್ಯ. ಆ ಜೀವನ ನಂಬಿಕೊಂಡು ಯಾರೋ.. ಎಲ್ಲೋ ಕಾಯ್ತಾ ಇರ್ತಾರೆ... ಅದನ್ನ ಉಳಿಸುವ ಪ್ರಯತ್ನ ಮಾಡೋಣ.\" @KicchaSudeep boss has arranged 300 oxygen cylinder to hospital .#KicchaSudeep #ಮೊದಲು ಮಾನವನಾಗು #kscs #KichchaForever  #StayHomeStaySafe @KicchaSudeep  https://t.co/DYrR0iqgWC", "Dear All, We are dealing in Oxygen Portable Cylinders with supplies all over India. If any one require can call directly 9814145420. +91 98805 98624: JAN SEWA NO PROFIT NO LOSS   #Oxygen", "dashboard for bed status in private bengaluru hospitals to launch on may 3  https://t.co/5YE69XPNGy  https://t.co/iDrsW6styp", "@Myndprime @boomzy1231 @Devilsmummy @Chopra_girl @DeeptaNagpal @Ridhi_98 @1Neetuchandra @anushka_purohit For oxygen concentrator.  https://t.co/UujKGYA8GO"], "need": ["@KunalSarangi @DC_Ranchi @BannaGupta76  Plasma has been arranged. Donor going through an antibody test right now. Still looking for a bed in a hospital where dialysis can be done. Normal creatinine level is less than 2. Patient has reached 7.", "@Tejasvi_Surya  Patient Name : Manas Ranjan Kar Symptoms: breathing problem, CT score -20/25 Since : Past 5 day Searching  hospital 2nd May  Mobile # 9482576796 SRFID: 2952511346803 BU-68858 #A 208, VS Chalet, 135/1A C , L.B. Shastry Nagar, 7th cross, HAL Post, 560017 pls help", "Searching for bed and oxygen both in gurugram Or close to gurugram  Name:Giriraj Lakhotia Age :36 Sector -71 , Gurugram Is patient in oxygen-No Searching for beds-Yes Covid positive- yes Attendee Mobile No. :9899166512 Relation to the patient-Brother Place-Gurugram", "Looking for a bed in Bangalore. Patient's Oxygen level was at 90 half an hour ago. Name: Sarojini Devi Age: 83 Address: Raheja Residency, Koramangala. Pls amplify. Even non-ICU bed works because patient is currently stable.", "Friends cousin admitted in Trustwell Hospital in Bangalore due to Covid. Just now he has been shifted to ICU due to infection spreading in lungs. Doctors said he is critical and need plasma of any group and they will exchange. Donor should be recovered from Covid positive after", "Patient name: Effie Fernandes  Area: Austin town, #Bangalore Oxygen%: 80 with support Patient waiting in St. Johns hospital.  BU NUMBER: 836676 Contact# 9886816169 #ICUBed required in #Bengaluru.  Please help! 🥺🙏 #SOSBangalore #SOSIYC @srinivasiyc @srivatsayb @IYC @IYCKarnataka", "#COVIDEmergency  #URGENTE requirement of #ICUBed with #Oxygen for a 70 Year old person in #Bengaluru (Nagarabhavi). Oxygen level has come down to 75. Pls reach on this number - 9886879099  @peakbengaluru @iamamsamk @Joydas @srivatsayb @RakshaRamaiah #COVID19India", "7. SPO2 Level: 93, but D Dimer value is 725 ng/ml 8. Is patient on Oxygen Cylinder?: No 9. Searching Hospital Bed Since- Yesterday 10. Patient at home/in hospital/: at home 11. List of Hospitals Visited: None", "we need leads for plasma donars or institutions in Nashik.  Plazma or Plazma Donar Required Nashik City Patient name:  Bhushan Ramavtar Khare Hospital:  Dr. Zakir Hussain Age-28 M Oxygen Saturation: 80/85 Plasma required: O+ Contact no. 7773900724 / 7276116168  (Shubham Khare)", "It's my mother... Required a icu bed urgently pls...   Patient name : M sampurna Age:46 BU number - BU-728969 Srf id - 2952511480393 Oxygen levels - 67-68 Requirement - ICU, ventilator  Contact - 9003113863  Address - Yelahanka, Bangalore  #COVIDEmergency #COVIDHelpBangalore", "@DarkenTheLove @RubikaLiyaquat @Shreedha__ @SonuSood @TeamSaath @ShyamRangeela Shifted to emergency ward but still looking for oxygen bed @DarkenTheLove", "Friend looking bed with ICU in Bangalore, any leads?   Patient Name : Padhmanabhen SA Patient Age : 75 Area / Location : Chikkanayakanna Halli  (Mana Tropicale) Symptoms : oxygen saturation down Since how many days : 7 SPO2 Level : 75 Is the Patient on Oxygen Cylinder ? Yes", "@drashwathcn @CMofKarnataka Sr from yesterday trying fir one ICU bed for friends father in Bangalore tried everywhere they are refusing tried BBMP aswell patient Saturation around 70 . He needs Ventilator and the Apoorva hospital Indranagar are saying they will discharge my friend is unable evn me plz help", "@CMofKarnataka we have admitted out father in law in mcGann government hospital of Shimoga, Karnataka coz he had breathing problem. His ct scan shows severe infection. It's been more than 48 hrs only oxygen cylinder is given to him and no medication at all. His spo2 is dropping", "Need 50L oxygen cylinder for an elderly patient at home, Bengaluru, CV Raman Nagar, please DM with any lead🙏 #BengaluruSOS #Bengalurucovid #COVIDEmergency #CovidHelp #CovidResources #COVIDEmergency2021", "Need for ICU with ventilator bed - Bangalore  1. Patient Name:-  ganesh s 2. Age : 53 3. Since how many days : 6-7 days 4. SPO2 Level : 70 and dropping  5. Is patient on Oxygen Cylinder ?:  yes 6. Covid Result (+ve)  Contact : 8105698882 (Varun)  @srinivasiyc @Tejasvi_Surya", "@RaeesKameena @iamtara_srk Type of Bed reqd:  with oxygen/ICU 15. Attender Mobile No :  7411128007 16. Relation to the Patient :  Son 17. SRF ID : 2952511047266 18. BU Number : BU673368 19. Co-morbid conditions:  diabetes 20. Doctor Name: aditya chowti 21. Other Remarks: oxygen fluctuates and severe cough", "@gunjanjeni @Sowmyareddyr @BSYBJP 8. Searching Hospital Bed Since ?: Afternoon 9. List of Hospitals Visited : 3 10. Covid Test Done ? : Yes 11. Covid Result: positive (+ve/-ve 12. Prefer Govt/Pvt/Any Hospital? : Any icu 13. Attender Mobile No : 9606030269 9036836106 14. Relation to the Patient : mother", "@srinivasiyc @IYCKarnataka   Please Help 🆘  ICU Bed needed in Bangalore  Name - Kamakshi S Age - 66 BUID - BU762081 SPO2 - 58 Contact - 9620334999 (Manjunath) At St John's Hospital rite now. Being asked to move as there no ICU Beds available.  Please Help.", "Please help out @Tejasvi_Surya or try +91 95913 40301 Helpline In Blr &amp; Chenai Sri Sathya Sai team has started  helpline to assist and fulfillment of beds,oxygen cylinders and food delivery for quarantined senior citizens etc in BLR and CNR call help line 08047190606 04446314343", "#Hyderabad  @SRKHydFans #SRKBLRCovidHelp Need #Blood Type :  O-positive At : Remedy Hospital Blood Component : Need Plasma O+ve from #Covid19 recovered patient Number of Units : 2 Primary Number : 7382929094 Via: @hbdsofficial", "URGENTLY NEED A VENTILATOR IN BANGALORE. PATIENT'S SATURATION HAS DROPPED TO 45 PLEASE HELP #bangalorecovid #VentilatorBeds #BangaloreSOS #CovidResources #CovidHelp @Tejasvi_Surya", "@DeccanHerald City needs oxygen supplies with out any breakEspecially prime hospitals should not suffer for want of supplies Many patients waited for long time then left because of non availability of Oxygen This issue should be addressed.", "@cspramesh @CancerGridIndia @AnantBhan @doctorsoumya @paimadhu @ManuPra18599785 @KrutikaKuppalli @himdaughter @aparanjape @MoHFW_INDIA @mygovindia Given this condition healthy can't visit hospital, what alternative ? Door step blood collection  ?", "@rashtrapatibhvn @DMMunger  I have scheduled the appointment for my parents through aarogya setu but the center which is at Munger refused to give vaccination citing a government order which we are not aware of till now. The hospital name is city critical hospital at Munger  https://t.co/1RVThTfpxT", "#Bengaluru !!!  Uma 57 needs an oxygen bed immediately. Please call the given number if you have leads.  @ForeverBLRU @peakbengaluru @WestBlockBlues @DunzoIt  https://t.co/nMsjXl0Pq7", "@ips_patil @BlrCityPolice @CPBlr Sir please check BBMP website down, when we call 1912 they are not picking, when warrrom no.called they are taking bu numbers but not allocating oxygen beds", "@OnlineBlooDonor  Please help  AB+ Plasma Needed   Patient's Name - Abhishek Srivastava Gender - male Age - 38 Hospital - Metro hospital  City - Preet Vihar , Delhi Blood group - AB+ve Contact person - Pratham Contact number - 9565039269", "Patient Name- Komal khimani Age- 55 Oxygen- fluctuate between 88-93 but serious breathing issues Health Issues- breathing problems Requirement-ICU Bad with Oxygen &amp; Ventilator Contact- 9924247201/9632014145/9900199877", "Kindly help 🙏🏻  Patient Name : Subhadra bhai.  Age : 50.  Urgently need ICU Oxygen Bed.  SRF ID : 2952600488335  Location : Doddaballapur , Karnataka.  Attender Number : 9743434507.  @DHFWKA @mla_sudhakar @BNBachegowda_MP", "@BBMPCOMM @BBMPAdmn @BbmpsplHealth @bbmp - sir I have been following with BBMP covid control room Yelahanka and 108 since 19 Apr for ICU bed but didn’t get. Now since KK hospital Yelahanka has become BBMP covid hospital but still not showing in Portal,request to cover under BBMP.", "https://t.co/bpXoDioXu4  Apex hospital Varanasi 🙏🏻 Please !", "Tocilizumab Injection. Required 2 doses very urgently for my brother in Chennai. His condition very critical &amp; now in oxygen support after 2 days of struggle. Please help. @srinivasiyc @sosiyc @IYC  https://t.co/Ee1sipEAFK", "@SonuSood @SoodFoundation Urgently require #Remdesivir for my uncle in Navi Mumbai, age- 70, who is been admitted to Niramaya Hospital, Kharghar. Any leads ? Please help @SonuSood sir 🙏🏻 #COVIDEmergency #Remdesivirinjection #COVID19India #CovidHelp", "4 : Fever,Loss of Smell, Breathless Oxygen Level with support &gt;92 5. Since how many days : 4 Days 6. SPO2 Level : With Support 92 7. Is patient on Oxygen Cylinder ? :Yes 8. Searching Hospital Bed Since ? : looking for ICU Ventilator   9. List of Hospitals Visited :", "@BertyThomas Trying continuously now from 4 days but still couldn't book any slot in Bengaluru.. I guess it is getting over in micro seconds or something. Also heard people are using contacts and getting these vaccinated at top private hospitals over here. This is nothing but a utter scam.", "BANGALORE  Patient name: Lester Dennis Lurshay Age/Gender: 36/Male Symptoms: Covid+ (difficulty in breathing) SPO2 (Oxygen%): 85 Patient in: PHC SRF number/BU ID:2952511834457 COVID result: +ve Attendant name: Geetha Attendant mobile number: +91 89041 11875 Type of Bed Ventilator", "Any leads for ventilator bed in Bangalore? One of my colleagues urgently needs help. @DeepikaBhardwaj @Tejasvi_Surya @Comedy_Praveen @Ateendriyo @tishtriya @brakoo", "@VijayImmanuel6 @SonuSood Bro no beds in Bangalore I tried with all hospital @VijayImmanuel6  tell them to contact BBMP again again only they can arrange any beds plzzzz", "#Hyderabad  #SOS  URGENTLY need Plasma Donor , Donor who recovered from Covid in last 3 months  Blood Group : B+ Hospital: HEALIX Hospital Location: Madinaguda, Hyderabad Patient: Vijitha Reddy Contact: +91 9867639192 (Bharath) @CovidPlasmaIn @covid_army @CovidHyderabad   plz 🙏🏻", "@SonuSood brother, my cousin urgently needs ventilator at JK hospital, Rayagada, Odisa.  He is critical can you please help.  @SoodFoundation", "@Priyanayak1292 @SonuSood @SoodFoundation Already called every hospital in the list. No ICUs are available.", "PLASMA NEEDED!  PATIENT NAME: RAVIRAJ KINI  HOSPITAL: KS HEGDE, DERALAKATTE, MANGALORE  Blood Group : A +  Contact Details: 9482842669 or 9535817646", "@BBMPCOMM @AshwiniMS_TNIE @prajwalmanipal , please help for bed allocation, registered with BBMP no success still, tried @ pvt hospitals still no success, please help  https://t.co/gWUDQldzRd", "#Patna #Patnacovid #BiharFightsCorona  Need urgently ICU Oxygen bed for a patient  NAme: Sheshadri Shekhar Age:30 Oxygen level &lt;85  Please amplify &amp; help!", "@krishnabgowda @DHFWKA Patient Mrs. Ravina  K/ Age-50yrs. Covid positive date - 27th April/ O2 level now- 86, Pulse 95/ Has fever, low oxygen and dropping pulse/ Area -HBR layout,Blr 560043 Looking for a hospital bed with oxygen, and ICU facility:Mob 9902867369 BU number:708587&amp;755867🙏", "12. Covid Test Done?: Yes  13. Covid Result: Negative 14. Prefer../Any Hospital?: Apollo greams Road or any facility with ventilator 15. Type of bed required  : With ventilator 16. Attendee Mobile: 9840923609, 9500090754 17. Relation:  Wife 18. CT Score : 16 19: No comorbidities", "@SonuSood Sir , could you please look into the below issue. Hi All, Ventilator is required urgently for an elderly woman 75+ age in Shrinivas hospital,Hazaribagh Jharkhand.Her oxygen level is 61 right now. And ventilator is required as soon as possible It is very URGENT. PLEASE HELP", "Urgently need Oxygen concentrator. Or oxygen cylinder. Pls help 🙏 @BJP4Delhi @TajinderBagga @ArvindKejriwal #Oxygen #CovidHelp #SOSDelhi #OxygenConcentrator @DelhiPolice", "Need oxygen concentrator. Bangalore. Person needs it for his dad, lost his mom to Covid earlier.", "@Tejasvi_Surya Can you or your team arrange one oxygen cylinder and regulator?", "Ventilator bed needed urgently 1. Patient Name : Praveen Kumar Soni\n2. Age : 32 Fever,Breathing,Low Oxygen 6. SPO2 Level : 45 \n7. Is patient on Oxygen Cylinder ? : Yes\n. SRF ID : 2952511127182\n14. BU Number : 651980 +918123130401 @Tejasvi_Surya @BBMPCOMM", "In urgent need of ICU bed in Bangalore for patient with neuro disorder. Antigen is negative but XRay suspects covid. Immediate help is highly appreciated. BBMP not entertaining without RT-PCR report. @WeAreBangalore @DHFWKA @sonalasthana", "@104_GoTN   1. Name: Kasthuri S 2. Age/Gender: 64F 3. Phone No:9994757677 4. Area/District:Tiruvanmayur Chennai 5. RT-PCR : NA 6. Name of the Hospital:NA 7. Current requirement (Beds-Normal/Oxygen/Ventilator): Bed with O2 8. SpO₂ reading:65-71 9. Chest CT Score:13/25 #BedsForTN", "@SonuSood SOS my brother is in critical condition and urgently need ICU bed in Delhi . His SPO2 level is less than 70  without oxygen. We tried the whole day but could not get oxygen. His lungs are severely damaged. Please help 9873013703", "12. Prefer Govt/Pvt/Any Hospital ? : Any  13. Attender Mobile No : 9341636130 14. Relation to the Patient : husband 15. SRF ID : 2952511345179 16. BU number : 694580", "@Ramani0808 A freind needs a Oxygen bed in vizag now. Above leads are not picking or reapinding. Anyone knows anything?", "Please help... Any leads for ventilator bed in Haldwani, Uttarakhand It's very urgent  @Keshu__10 @HaramiParindey @Trendulkar @vineetkumar_s @theprayagtiwari", "@104_GoTN  (1/2) **Details Needed** 1. Name: TO BE KNOWN 2. Age/Gender: 55 3. Phone No: 9344754234 4. Area/District: MANDAVELI / Chennai 5. RT-PCR (Positive/Negative):  6. Name of the Hospital (If admitted): 01 May morning (x) 7. Current requirement : OXYGEN #BedsforTN", "@Tejasvi_Surya sir I am trying to get a bed allocated at Columbia hospital and the hospital people are playing with us big time.", "@krishnabgowda bed with oxygen required in Baptist hospital . patient from Hosahalli. 9986994099 Kumar. Please help @mla_sudhakar", "Looking for an #ICUBed with Ventilator urgently in #BengaluruSOS   1. Patient Name : H n narasinga rao 2. Patient Age : 66 3. Area / Location : basaveshwara nagar 4. Symptoms : breathlessness oxygen very less 5. Since how many days : 4 days 6. SPO2 Level : 76", "Required: ICU bed with oxygen support.", "Need oxygen in Kolkata.👇 Please provide any leads. #SOSKolkata #Oxygen #SOSIYC", "Basaveshwara College and Hospital, Khb colony, Chitradurga - ran out of Remdesivir. A friend’s dad needs the last dose urgently who is in an ICU there. Any help anyone??? Reach out to me if help found.", "@104_GoTN  **Details Needed** 1. Name: kannan V 2. Age/Gender:60 3. Phone No: 9841987841 4. Area/District: urapakkam, Chengalpet 5. RT-PCR (Positive/Negative): positive 6. 7. Current requirement : oxygen  8. SpO₂ reading: 86 9. Chest CT Score: 0 10. Other remarks: #BedsForTN", "Urgently need leads for oxygen cylinder in Noida / gurgaon . #CovidHelp #COVIDEmergency @COVResourcesIn @CovidKhoj #CovidResources", "@myogiadityanath  urgently requireed O+ plasma for my friend Father  Patient name :- Radheshaym sharma Hospital : Mulayam singh Hospital Meerut Contact :- +919457178883 @UPGovt @UPmedicaluk @MP_Meerut @AbvpMeerut18", "@SoodFoundation  @SonuSood   Helo Sir, needed oxygen support urgently in delhi..pls help either with oxygen concentrator or oxygen cylinder... Sp 02 down to 80.... Looking for hospital bed.. without luck...pls help", "Patient Name: Oruganti Sasi venkata Ramana Murthy Age: 55 Gender: Male Blood group: O+ Oxygen level: 75-80 Contact: 9951291356 (sister) Hospital: Lazarus Requirement: Icu with ventilator  @RRRMovie @SoumyaDivakarB : Would you guys have a lead to help?  #COVIDEmergency", "@sayanigupta can you advise some hospital leads in Kolkata ? Entire family tested positive.", "@104_GoTN *Details Needed* 1. Name:Chittybabu Govindhasamy 2. Age/Gender:58/Male 3. Phone No:9894724952 4. Area/District:Vaniyambadi 5. RT-PCR (Positive/Negative): Positive 6. Name of the Hospital (If admitted):Not admitted 7. Current requirement (Beds-Normal/Oxygen/Ventilator):  https://t.co/TT823vZBob", "Update 9:30 am: Temporarily admitted in Jaynagar Gen Hospital. Still looking for ICU bed.", "She got the bed and oxygen but Dr says she may require ventilator support since infection level is high. They dont have ventilator. Plz help.", "@palaceintrigue_ @chhuti_is Please try Aryan Oxygen Services South Sinthee at 9007427926. (Last verified: 2 day(s) ago)", "Meerut, Saharanpur, Shamli..  If there is any bed available in a hospital with oxygen, please let me know.  My friend in Shamli needs it urgently.  #CovidHelp #CovidSOS #Shamli #meerut", "#SOSNoida #OxygenNeeded  Abhay Srivastava  COVID+  Gaur Chowk, Noida Extension, Noida  Oxygen level - 85 Contact Number - +91 96507 30340 Needs #OxygenCylinder at home urgently. All Help appreciated  @BJYM @IYC @ABVPVoice @DCP_Noida @ARanganathan72 @DeepikaBhardwaj @coprajaneesh", "Thanks to all who assisted ; not able to get the bed still; however the family was able to arrange for an oxygen cylinder to stabilise the o2 for now. 🙏🏼", "Hi God Massenger ,  My friend father is in ICU in Apex hospital, varanasi, uttar pradesh near dlw , just verified they need 1-2 unit B+ plasma and 2 remedesivir injection 🙏🏻  Name - Ram Milan Vaishya Age - 50 yr / M Contact - Virendra (son -+91-6260625844 ) #SOSIYC @srinivasiyc  https://t.co/YzSE4ZL5YB", "@divyajn07 #sos #Plasma Donor required for #Corona patient  Need plasma urgently at Kailash hospital, Greater noida Blood group A +, A-,Ab+, ab- Patient name - Mulraj ( Punjab national Bank Employee) #Bankers Attendant - Ravi shankar  Phone- 8340659186 Date: 3 May, 2021", "@104_GoTN @ChennaiIPL  #BedsforTN urgent COVID-19 : Need an admission in any of the Multi Speciality hospital for a Covid patient - 52 yrs of age  He is admitted in Unittas Hospital, Tambaram. He need HiFlow oxygen or NIV Bed  Name : Babu  Contact ; 9740978585   @chennaicorp", "Urgent pls help in arranging Oxygen cylinder/refill/concentrator in MORADABAD(UP)  current oxygen level is 78. pls help.  @GautamGambhir @DMMoradabad  https://t.co/r2ae62ETwi", "@sleeplesslyours @DanishSait @thevirdas @gurruchoudhary @RachanaNoble @MeenuHayMurVAni No dude  Ventilator is available but not ICU.. i really dk what to do", "Ambulance Services for Ghaziabad  7838988546 Ambulance 9990008877 Swadesh Ambulance Verified at 11:57AM 01-05-2021 #delhincr #AmbulanceDriver #Ghaziabad", "@madhuk9 New Varalakshmi Hospital Type: Private Hospitals Available general beds: 13 Available HDU beds: 0 Available ICU beds: 2 Available ICU beds with ventilator: 2 Total available beds: 17 Verification Source: BBMP Phone: 8023424044 Google maps address:  https://t.co/vCHmOM1DFx", "Emergency plasma required- Patient name  : Manish Agarwal Age  : 44 Covid +ve since: 11 April Date of requirement  : 01-May-2021 Blood group  : O+ Hospital name :  KD Hospital, Mathura, UP Relative name : Mrs. Payal Agarwal Relative number  :  9623-568-255", "@peakbengaluru Hi all, a plea for help.  A friend's aunt is critical, covid positive with o2 at 64. Not able to get any icu hospital beds across bangalore hospitals. Any genuine leads on icu bed availability,  pls dm at 9862 22406", "Need A+ plasma Donor  Patient name :  Arati Srinivas  Age :41 Gender : female Blood group : A+ Contact  :9986632365 Hospital:  Fortis nagarbhavi  BU-676699  Address : no 20, 3rd main, maranahalli, subbana garden vijaynagar Bangalore 40 #plasma @LavanyaBallal @Bhavyanmurthy", "Need 400ml plasma A- blood group in Jaipur urgently. My sister is covid positive in ICU at Fortis Hospital. Please call 9880194890 @rsingh4u @maharajasharma  please activate local Jaipur connects", "@nathan_archana Can anyone help? Patient name lakshminarayanan.s Age ;50/M Oxygen level; 92shortness of breath is consistent Covid result positive  on 3/5/2021 SRF ID ; 2952511825744 BU no. BU 826512 Kundalahalli  Bangalore 560037 Ph.9686236150", "Need emergency hospital ICU bed in Bangalore for friend's father with Spo2 levels at &lt;80. We've been trying since last evening. Both parents are in emergency need #SOSBangalore @TeamNamma @Tejasvi_Surya @TellDM @AdityaRajKaul @WeAreBangalore @TajinderBagga  Cc @Sinsinwati", "@mla_sudhakar hospitals are asking patients to arrange for remdesivir injection, when it’s not available in pharmacies how can we arrange. If we reach to drug control helpline, they ask indent from hospital. Patients are suffering because of this pathetic loopholes in the system.", "Anyone trying to source #Remdesivir been told by the Govt helpline (+918951755722)  that the hospital where the patient is not registered with BBMP? How do you proceed?", "Urgently need help, please amplify 1. Name Arokia Mary 2.Age 46 3.Akshaya Nagar, B'lore 4.Breathing issues since 4days 6.spo2 level: 80 7.covid +ve 8.Need hospital with ICU/oxygen 9.Steffi Das-9980860034 /98800 08949 @srinivasiyc @disharavii @Sowmyareddyr @LavanyaBallal #SOSIYC", "@CMofKarnataka @MoHFW_INDIA @HealthCareGov @BSYBJP @narendramodi @mla_sudhakar I requesting you all,covid helpline number will not working in Bangalore, I am trying to make a call to that number 1912,does not working @mla_sudhakar kindly help me to get the ICU bed for corona pnt.", "Mangala 2. Age : 42 female 4. Symptoms : Breathing difficulty low oxygen levels  Since 5 days  6.SPO2 Level ( sat): 45 10: Covid test done ? : Yes 11:Covid result : +ve 15: SRF ID: 2952511729306 16: BU number: But774462 Patient need ICU bed ventilator bed 953825296 #SOSBangalore", "@LicypriyaK Can you help me! I have to send 2 oxygen concentrator to india for relatives. Any cheaper shipping service? 🙏🏻", "@aliaa08Urgently need a ventilator bed for friend’s father in Delhi. Please help!  Patient Name - Dinesh Chopra Age - 60 Years", "Any help on making Oxygens Plants and Ventilators for each hospital.. Also there are scams happening in Bangalore on covid bed availability.. any guidance sir..  https://t.co/krupO4z7Xj", "@VK84015570 @kaali02  @Praveen__KP @unexpected5678  Please help with a hospital bed with Oxygen in Guntur", "#CovidSOS #COVIDHelpBangalore   Patient Name: Bhavneet (Female)  Age: 38 Hospital Admitted: Vydehi Hospital, Whitefield, Bangalore  Blood Group: B+ve Kind of Bed Required : ICU/Ventilator  Plasma also required Attender Contact: Puneet Anand - 9611674588", "🛑Urgently Req. ICU- Ventilator Bed Patient name : Mahadevaiah Age:73 Gender: male Area: peenya esi Symptoms: covid-19 SpO2 lvl :- 35-40 oxygen cylinder- yes covid test done :yes covid result:positive  SRF:2952511635405 BU No:744114", "@SonuSood brother, my cousin urgently needs ventilator at JK hospital, Rayagada, Odisa.  He is critical can you please help.  @SoodFoundation", "Need a oxygen bed urgently for a relative. He is in ambulance roming all around delhi for oxygen bed. Please help. 7760556254 @GautamGambhir please help sir", "Any leads for a hospital bed in a covid care centre in Delhi?  without oxygen will do..TIA  #CovidDelhi #CovidhospitalbedDelhi #", "@srinivasiyc Sir pls help for plasma  #Bhopal Name of the patient - Shashi Rai  Age - 59 M/F - F Hospital name - JK hospital, Bhopal Plasma needed - A+ Covid recovered more than 30 days  Patient attendant number -  9096336315 (Gourav) 9096009956(Gagan) 9893699432(Pranjal) O2 - 77", "@RubikaLiyaquat plz help Patient Name- Anita  mishra Age-55 Gender-female Hospital (if admitted)-Hailaet kovid hospital Blood group -o+ Blood bank name (plasma)- any group will work City-kanpur nagar Contact-7007830239 Other info- 7007830238", "#Bhopal  Name of the patient - Shashi Rai  Age - 59 M/F - F Hospital name - JK hospital, Bhopal Plasma needed - A+ Covid recovered more than 30 days  Patient attendant number -  9096336315 (Gourav) 9096009956(Gagan) 9893699432 (Pranjal) O2 - 77  @srinivasiyc  Sir please help", "Need a ventilator bed in Bangalore for my friend please help his O2 is 45. Please help someone.   @SonuSood sir please", "@Saritaranipatr1 @collectorpune1 @CollectorPune @CMOMaharashtra @maharashtra_hmo @citicarepimpri @PuneCityPolice She is fighting the battle alone while her husband is still on oxygen.could you please help 🙏  @srinivasiyc @arunbothra @newslaundry @indiacares_2020 @sardesairajdeep @SonuSood", "Mathru hospital kengeri bangalore running out of oxygen, 3-4 patients in very high critical stage, authorities plz help. #bangalorecovid #CovidSOS  #HealthDepartment  @DrSudhakar_K @DrSudhakarMLA  @CMofKarnataka @DHFWKA @MoHFW_INDIA @BBMPCOMM  @STSomashekarMLA @MunirathnaMLA", "If anybody has a arrangement of oxygen concentrator please let me know required very urgently", "Hi, I want  to purchase an Oxygen concentrator for friend parents who may need it due to covid. The product needs to be shipped to Madanapalle, Andhra Pradesh - 517325. Please provide any lead Please help me. #OxygenConcentrator  #Oxygen  #AndhraPradesh", "KINDLY SUPPORT FOR B+plasma for covid patient. 1.patient name: k.munaswamy raju 2.Age: 59 3.Blood group: B+ve  https://t.co/XfuZv1yu1w: Narayanadri hospital,  9900182304.hemanth", "@krishnabgowda Where are you getting oxygen and vaccination for needy in your constituency please reply sir ?"], "useless": ["@Tejasvi_Surya @balamy @NandanNilekani Same type of fraud might be going on in Delhi regarding bed, medicine scarcity of oxygen. BJP Delhi should take initiative in this regard to help people in this crisis. Time to play active role to help the govt and people of Delhi. @BJP4India @BJPdelhi0908 @HMOIndia", "several patients in the state have already died due to a critical shortage of oxygen supply in hospitals but the State and Central government are still busy passing the blame onto each other. how many more deaths to witness and how long it will take for this to end. 😐", "2 #COVID19 patients died in KBN Hospital #Kalaburagi due to shortage of #Oxygen.Hospital authorities say DC Raichur suddenly stopped oxygen supply to KBN hospital since Thursday ,which led to the shortage. Now 50 cylinders have been sent to hospital @mla_sudhakar  @PriyankKharge  https://t.co/Ja3iK4T6u0", "Chalo chalo khela khatam, ab chup chaap vaccine aur oxygen bhejo. :)", "@radnus0 @maathinamalla Both are extracted from air. The principle is the same. No rocket science here. When you want Oxygen, just let out Nitrogen and vice versa. The real challenge is not production, but after that.", "@nagendrakumars @fayedsouza That's a 'responsive' responsible govt. @narendramodi. Now go for the vaccines...  Next, bring the errant states and hospitals that refused to act on the order to setup oxygen plants to book. Public needs to know. Nation needs to know ! @republic", "@Tejasvi_Surya many hospitals rejecting admission without covid+ve test results which will take time to come out! pl have the hospitals be responsible and admit based on CT Scan or Antigen test as well... or else many will loose their dear once!", "Bhagavad Gita as Oxygen  Updated  -  https://t.co/u9g8cni3w5..", "*️⃣ In addition we are deploying final year students for Teletriage &amp; attend to mildly symptomatic covid patients. Hospitals had requested additional staff support and we are providing them. Without any restrictions, transferring interns between colleges/hospitals is allowed.  2/3", "@NARAYANRAO12 @TuhinaaChndrskr @Tejasvi_Surya @BJP4Karnataka @Sowmyareddyr Please learn how to speak first, Mr. Rao. I don't have to give you any, for that matter. I have acquaintances who stay near the hospitals, the mainstream media, some people associated woth political parties (BJP, INC , JDS). All have unanimously agreed that the scam happened.", "The BJP's hitman Tejaswi Surya, pretending to expose a hospital scam, uses it to launch a tirade against Muslims.  https://t.co/7MrnZMAaoy", "Experts say when people movement reduces cases will decline so does the load on hospitals/frontline workers. While increasing resources we need this. I am saying this because most of the people still not wearing masks and roaming freely causing more damage. 🤦‍♂️ @narendramodi", "@avvjain Hoping the situation here in India gets better, because few hospitals have run out of Oxygen.", "Friend’s family member admitted in Bengaluru hospital, ran out of oxygen.  Sonu sood and team worked overnight and arranged approximately 15 cylinders saving lives of around 25 patients.  @SonuSood should be awarded Bharat Ratna for all his contributions.  Exceptional work🙌🏼", "@prasanna_says Quick tip: Please keep the pin code of the hospital handy.", "@Tejasvi_Surya @annamalai_k @VinojBJP Pls come back and focus on Oxygen, vaccine and beds in south Bangalore!", "@drharshvardhan @MoHFW_INDIA @PMOIndia  https://t.co/UzcSQbokIO  Central Govt nexus with reliance industries exposed. With a oxygen cylinders from Saudi Arabia", "@PMOIndia Suggest to allow private hospitals to import US EU approved COVID vaccines with no custom duty n keep the COVIDSHIELD N COVAXIN under Government Hospitals at no cost to maximize coverage n easier reach to poor households🙏", "@jananisampath Now Sumanth will not question where are Oxygen cylinders. as one lot came to Chennai.", "Central Vista dome project, in my view, is completely an unwanted project and that too at this time. They can focus on building hospitals and schools. Let’s prioritise and put money in the right project/bucket.", "@AamAadmiParty @SanjayAzadSln Agar oxygen ki killat hai to AAPiyo ko kaha se mila oxygen. Kya AAP sara oxygen divert karke apne mantriyo ko de rahi hai?", "@BSYBJP Dear Sir  It is a good step.  Please take very strict action against BBMP official and agents who are playing with life's of our citizens by blocking the available beds in the hospital and later selling it for profit.  Please put them behind the bars.  You can do it.  Good luck.", "@aajtak Oxygen के लिए ये लोग कुछ करेंगे? लोगों की जान बचाने के लिए कुछ करेंगे! या यूँही नेतागीरी करते रहेंगे.... इन लोगों को कुछ सोचना चाहिए कि जनता के प्रति भी इनका कुछ दायित्व है 😐", "@CTRavi_BJP Celebrate the 24 deaths at Chamarajnagar due to lack of oxygen. Your priority is power and you are making it clear everyday.", "@eshwarappa was dead when 24 Innocent lives were killed due to no oxygen has appeared now to defame Muslims Community along with communal Virus @Tejasvi_Surya. You politicans with so much hatred will never learn to be Humans. RIP y'all", "@srivatsayb @JeenalGala Is this one form of Nazi \" Gas Chambers\"... No Oxygen", "Just do away with these “inauguration ceremony” photo-ops…that create unwanted nuisance/crowding at hospitals!!", "@ShatruganSinha 1992 you were in the Ram Mandir Movement. Tab Hospital movement main bhag lete to yhe naubat na aati.   @ShatruganSinha for your self introspection, reaction and response.  Mandal Kamandal karke humare jhole main ched kar diya.", "We Salute Mukeshbhai for supplying 1000 MT per day Life Saving Oxygen - 11% of India's demand. Blessings of the Lord are with you and your family. You are a great soul.  @narendramodi_in @AmitShah @PiyushGoyal @nsitharaman @rsprasad @nitin_gadkari @PrakashJavdekar", "Update : was greeted with an empty hospital &amp; stickers all around that there are no vaccines.   Spoke to the local Health officer who clearly said 18+ will not happen soon since the Karnataka government instructions are to vaccinate only individuals who are 45+.", "2. What is the issue here- is it availability or transport logistics? 3. Other than the 812 tonnes of liquid oxygen that Karnataka produces, union govt promised another 800, what happened to it? Is it reaching the state? If yes, from where and how? We don't want vague statements", "Where are you Mr. Genius @Tejasvi_Surya you cried and denied oxygen shortage, then how 24 innocent people died due to lack of Oxygen. Who will take responsibility for this criminal negligence. #ResignSudhakar #karnataka #Chamarajanagar", "@raghav_chadha Why does Delhi produce no oxygen??", "@KanganaTeam “Oxygen that we are forcefully drawing...”??!!😳..just like the covid count record being broken each day,this dumb lady keeps bettering the “most nonsensical tweet of the day” record, each day...in lockdown times,if nothing her idiocy is providing some entertainment atleast 😜", "@manabhardwaj @ProfKapilKumar Remdesivir is not recommended by WHO for covid treatment. But still our hospitals are prescribing is it not suspicious?", "@rohini_sgh Something needs to be done with this Delhi situation. State govt, LG and Centre needs to sit across table  and deal with the situation. It must be so stressful for frontline staff at hospital where they have to decide on rationing Oxygen. This needs to stop big.", "@drharshvardhan wid all due respect, u have no idea of the DAMAGE that this \"saluting the PM\" habit has done to the PM himself &amp; to the entire nation! Time is'nt to impress but to enable the PM with the right data, we desperaly need quick actions &amp; assurance on Oxygen &amp; Vaccines supplies! Pls🙏", "@dp_satish @SRVishwanathBJP @SRVishwanathBJP is doing good job. From testing to vaccine to oxygen to help for cremation.   Yes. Board wrongly done.", "@msisodia Please hold each MLA responsible for finding hospital beds or Oxygen for patients in his constituency. Provide each MLA 10 to 20 AAP Volunteers for assistance.", "@Bhoawkaal @samirkapoor1971 Correct! 21% is Oxygen.", "@PeteLau @OnePlus_IN Oxygen os 11 for OnePlus 7t sucks", "Even now, most crisis scenes are generating from mismanagement. Oxygen is available in black market, but not in hospitals. Remdesiver is available in black market, but not in stores. Many beds are occupied by people who don't need it while critical patients are crying for beds.", "@kewekhapetherie @chophika_sumi It should be made mandatory for all the Hospitals to have Oxygen plant .....", "@BSYBJP @PMOIndia @narendramodi @AmitShah @drharshvardhan @JPNadda Good that you woke up ultimately, probably to show your masters that you are doing something too.  Meanwhile, pathetic horrendous situation prevails in Bengaluru where you have:  NO hospital beds NO Medical Oxygen &amp; medicines  NO support system in any place  NO cremation place", "@writewing5 @rajeev_mp Yes and it is why we needed to have been better prepared. Did we  1. Claim to have beaten Covid and saves the world  2. Conducted 8 phase elections and Mega events 3. Vaccine Maitri 4. Export oxygen in record fashion 5. Not make attempts to procure any other vaccine earlier", "@IndiaToday Common can we stop this from happening ... This is really bad and the loudmouths in Govt really need to stop telling lies about Oxygen supply .", "This old gent got his vaccination early. Yet, even as the country is in the throes of death, he has never visited a hospital. Or a morgue. Or even a cremation ground. But he never wastes a moment for publicity and politics. The farmers’ protest is still on. Shame.  https://t.co/23Akct120x", "@CPBlr @jayanagarps This is commendable!   Can the general public have a helpline for grievances against ambulance services fleecing people.   This is happening enmasse’ and people are being cheated in desperate times @DgpKarnataka", "For each district a central monitoring room like in railways or airports ..vacant slot, take off or land ?real time bed availability without patient name.. just map the beds and force every hospital to just share their real time data on in and out patient ..likely discharge date", "@mkvenu1 DRDO has already started setting oxygen plants at central government hospitals", "Dear crypto friends, We have very less time to buy the Oxygen Concentrator to save hundreds of lives in India. Plz help me, help India🇮🇳by donating any amount on this link 🙏🏻 ⤵️  BTC -1NLk6B3mrkQPN6xrYdeFBWimsuxhG68Hch #DogecoinToTheMoon  https://t.co/r7ZLqpFbtZ", "Bribe for BBMP quota hospital bed booking unearthed by BJP MP Tejasvi surya and BJP MLAs. BBMP officials took money to block beds for which govt paid for treatment. All beds were booked and showed scarcity. MLAs and MP to meet CM and complaint against BBMP officials.  https://t.co/qjOgIDyDtm", "@imSudhakaraRao @MadhukumarVP1 @INCKarnataka ನಿಮಗೆ Ambulance ಬೇಕಾ.? ರೆಮ್ ಡಿಸಿವಿಆರ್ ಇಂಜೆಕ್ಷನ್ ಬೇಕಾ.? ಆಕ್ಸಿಜನ್ ಬೇಕಾ.?  ಕಾಂಗ್ರೆಸ್ ಗೆ ಸೇರ್ಪಡೆ ಯಾಗಿ... ಕಾಂಗ್ರೆಸ್ ಪರ ಪ್ರಚಾರ ಮಾಡಿ.. ಕಾಂಗ್ರೆಸ್ ನ ಸಾಮಾಜಿಕ ಜಾಲತಾಣದ ಯೋಧರಾಗಿ...  ನೀವು ಆಗಲ್ಲ‌ ಅಂದ್ರೆ, ನಮ್ ಹತ್ರನೂ ಯಾವ ambulance, injection, oxygen ಇಲ್ಲ...  ಇಂತಿ ಕಾಂಗ್ರೆಸ್", "Could you get details in this format  5. Since how many days : 2 6. SPO2 Level : *40 &amp; Dropping* 7. Is patient on oxygen cylinder? Yes / No : NO 8. Searching hospital bed since? : Now 6am 9. List of hospitals visited : 5 10. COVID-19 test done? : yes 11. COVID-19 Result : +ve", "@fayedsouza @tinucherian Because it’s about BJP running out of oxygen in WB, KL &amp; TN...", "I hope someone is auditing oxygen supply and demand in All cities especially ones with explosive growth in patients like #Bengaluru and #Chennai and planning back up options.", "All we do is stand, stand in bank lines, hospital lines, NRC/CAA lines and now at Funeral lines. But the thing is our PM never stands with us. #IStandWithModi #achedin", "@indiamusings One of the rare times I disagree. Rampant black marketing of oxygen and poor management of hospitals, Covid by the CM has diminished his status IMO.", "@Proudly26290119 @MeghUpdates But the union health minister is also saying there is no shortage of oxygen in the country. So Kejriwal is not alone is scoring political points.", "@Sophie_Choudry There are many who converted their luxury suv into free ambulance. Just they dont want publicity so doing it as per wish. While there are few who are doing it for publicity.", "INS Talwar arrives in Karnataka.  Today @NewMngPort received @IndianNavy’s INS Talwar, carrying 40 MTs of Liquid Medical Oxygen filled in cryogenic containers from Kingdom of Bahrain.  More medical supplies are scheduled  to reach us in the coming days!   @PMOIndia @CMofKarnataka  https://t.co/2Y8HzkbwFl", "@yemmay Which Hospital is this? I couldn't find any slot. I'm guessing you tried early in the morning.", "@ANI Twitter has banned more \"white\" people than any. Stop giving her a platform to spew lies and hate. Save your oxygen.. #KanganaRanaut", "@Darshan_skumar @peakbengaluru Are these services with oxygen?", "COVID-19: SC directs Centre to prepare buffer stock of oxygen for use in emergencies | via @indiatvnews  https://t.co/6SaGtWsFve", "Oxygen shortage: 12 Covid patients die in Chamarajanagar district hospital in Karnataka   https://t.co/xKj73BxJdL", "Police book Bhopal auto-ambulance driver Javed for violating Covid rule, withdraw case after outrage  https://t.co/KDiDVrYsgB", "12. Prefer Govt/Pvt/Any Hospital ? : Pvt/Govt 13. Attender Mobile No : 6362270134 14. Relation to the Patient : wife 15. SRF ID :2952511734032 16. BU Number :BU-784534", "@erjayagrawal Even if price is Rs 300 what is the problem. People with corona are paying in thousands to ambulance just to take them to hospitals. Nobody complains when a movie makes super profits then why complain for vaccine price. Today some of the vaccines for infant are over Rs.2000 also.", "No beds in Hospitals,No Oxygen to Breathe, No Vaccine to Inject no Wood to Cremate..  where are the Gods, Godesses  @ttd_seva #IndiaFightsCorona #COVIDEmergency #COVIDSecondWaveInIndia #CovidHelp #SOSTDP #SOSBangalore #SOSDelhi #SOSNoida", "\"Put your mask first before you help others\"  There is a reason why they say this.   We should help our own people before exporting Vaccine and Oxygen to others. Buddhu exported for global PR and we are left with nothing.  https://t.co/jyjIOzTa0f", "Ajeeb se ghadi aagayi hai Kisi ka pariwar toot rha hai To kisi ke sapne Koi bhuka mar rha hai  To koi bina oxygen ke🥺💔", "China assures help after Sonu Sood flags ‘blocking’ of oxygen concentrator imports  https://t.co/inshuCM2TF   #China #Sonusood  https://t.co/zDmh6LPG27", "India deploys seven warships to transport large oxygen containers  https://t.co/2E8w5lWcir  via NaMo App  https://t.co/BdZwgIO0yz", "any such statistics about 162 Oxygen plants and account of PM Care fund, and why state have to pay 400 to 600 for the vaccine when center pays only 150", "People are dying not because of covid but due to lack of vaccines and oxygen in India. What a terrible situation.", "@surnell @Tejasvi_Surya Similarly I am sure please see the tally of hospital as to how much oxygen one uses against other hospitals...like for eg if 10 people use certain amount of O2 same or less should be in other hospital too .if there is too much difference it has to be checked", "@raalferns @sagargaikwad @AjaySag42737877 @DrSubhasree Earlier this year centre had given the delegation and funds to states for creation of Oxygen plants and Medicare infra. No CM has denied this. Fact is Maharashtra alone has contributed over 30% of Corona deaths and the CM was busy doing vasooli.", "@dhanyarajendran @geetikamantri Apparently price gouging has begun. Private hospitals are offering covaxin @1200 &amp; covishield @900", "@brajeshlive Asal me galti logo ki hi hai aaj bhi log netao se nahi puchte hai ki hospital school colleges kyun nahi bane MP MLA se nahi puch rahe hai ki dilwao oxygen apni fortuner becho ya jaguar koi matlab nahi dilwao Black me kharido ya government se bolo par log apna ghar nahi jale  bs..", "Request users to return your empty medical oxygen gas cyclinders. This can save many lives through refill. #empathy #OxygenCylinders #Oxygen #sdg17", "Visited MS Ramaiah and KIMS hospitals and discussed augmenting beds for treatment of Covid-19 patients. MS Ramaiah hosp has agreed to reserve 850 beds incl 450 oxygen &amp; ICU beds, and KIMS will reserve 133 oxygen beds for Covid-19 treatment. Together we will defeat the pandemic.  https://t.co/GFSS854fhh", "@VishweshwarBhat Same thing with oxygen scarcity. Hospitals are wasting oxygen just to put the blame on state and central leadership. Need an inquiry on this too.", "@Tejasvi_Surya we are all born as humans. Stop creating riots in the middle of pandemic. You have a great responsibility to do now which is arranging beds, oxygen and help out fellow humans. Please do that instead of playing a blame game.", "@MooochhMan @DammnGirll Oxygen cylinder agra???", "@Tejasvi_Surya Gr8 sir, similarly please do monitor distribution of oxygen and ventilators supplied by friendly nations. Thanks you will be remembered for long time, you are saving life that is supreme.", "It hurts to see that its INC which people reach out for oxygen or other help during pandemic, its INC which puts the pressure on Modi for national issues but people still don’t vote for it. Not even one win. Democracy is a weird thing.", "@mla_sudhakar Sir,  This thinks we know about last year. Can u please update on Oxygen, ventilator, bed, central trains for bed.", "@Tejasvi_Surya  - Can you or anyone from NDA government share similar update on:   ICU / Oxygen Beds : List of hospitals available Pan India ?   Oxygen Cylinders : vendors info ?  Remdesivir : State wise availability ?  Results show not @BJP4India but Covid-19 is growing all over", "indians standing in lines: demonetisation 2016 food packets 2020 crematoriums 2021 oxygen cylinders 2021 covid beds 2021 covid vaccinations, without vaccines 2021  and always, line mei sabse last.", "IAF ferried 47 oxygen containers with a total 830 MT capacity from abroad  https://t.co/IZ6plloO2n  via NaMo App  https://t.co/XnSguRWoSc", "Devotees neither received Maya nor Rama.  Neither got power in Bengal nor oxygen.  #ElectionResultsFace with tears of joyFace with tears of joyRolling on the floor laughingRolling on the floor laughing    https ://  https://t.co/Fey32hcbIX", "Daily jabs continue to decline as private hospitals remain short of vaccines  https://t.co/4sebjTvM64 via @timesofindia", "Why this? Are others getting it? Don’t they have enough vaccines? Which hospital is this? @mla_sudhakar @KarnatakaVarthe @DHFWKA could u pl look into this. Second dose is absolutely imp.", "@AshwiniMS_TNIE  @ajavgal  @samyuktahornad @jananivathsala Oxygen level:60 ಇತ್ತು ನೆನ್ನೆಯಿಂದ ತುಂಬಾ ಪ್ರಯತ್ನ ಮಾಡಿದ್ದೀವಿ,ICUಬೆಡ್ ಸಿಕ್ಕಿಲ್ಲ. ರೋಗಿಯ‌ ಆರೋಗ್ಯ ಮತ್ತಷ್ಟು ಹದಗೆಟ್ಟಿದೆ. 1912-1ಸಹಾಯವಾಣಿಗೆ ಕರೆ ಮಾಡಿ ಮಾಹಿತಿ ಕೊಟ್ಟಿದ್ದೇನೆ, ಯಾವುದೇ ಉಪಕಾರ ಆಗಿಲ್ಲ. ದಯಮಾಡಿ ಸಹಾಯಮಾಡಿ 🙏  https://t.co/jqm2fEXhWG", "Covaxin is not available in all the Govt Hospitals in Karnataka, people are panicking for 2nd Dose @CMofKarnataka @PMOIndia @mla_sudhakar @blsanthosh @drharshvardhan @RAshokaBJP @narendramodi @drashwathcn @Tejasvi_Surya @CTRavi_BJP #vaccination #BharatBiotech", "The Deputy Commissioner of Mysuru Rohini Sindhuri has clarified that she neither rationed nor controlled #oxygen supplies to Chamarajanagar. #OxygenShortage #OxygenEmergency #COVID19 #CoronaSecondWave   https://t.co/DE3JfegyBl", "@AJAYAWASTHI108 @GarimaHirwani @ArvindKejriwal @TajinderBagga @CMODelhi दिल्ली में परिवार में दो लोगो की बेड ना मिलने से मौत होगई, तीसरा कोविड मरीज hospital में बेड के लिए संघर्ष कर रहा है ! ऑक्सीजन लेवल कम हो रहा है !   *मरीज का नाम* Tanvi Rastogi  *उम्र*   27 📞मोबाइल नंबर 9899782833 @RubikaLiyaquat ji pls help  @drsangitareddy @chitraaum", "So apparently a player went to a Hospital for scans  and Varun and Sandeep have tested #COVID19 Positive. Sheer Negligence by KKR management to allow these two players back inside the bio bubble. BCCI should impose a heavy fine on them. #ipl2021 #KKRvsRCB", "@utkarshtalks @saichopparapu I got vaccinated at the same hospital on Tuesday at 9 am. By 7 pm I was feeling fatigue, by 10 pm had fever, headache and body ache. Carried over to the next day but completely fine but Wednesday late night", "@siddaramaiah Leave the resigning part aside... First help those in need... Those people resigning now won't provide oxygen to the needy... What r u guys doing other than blaming the govt in twitter??  Be helpful or keep quite... dont do politics at this time atleast!!", "Thank you for your help everyone! He got bed in one of the private hospital at ashram road.", "Don't pay extra money for  Hospital beds Injection ICU   Inform if they are doing so to government officials @KTRTRS @RaoKavitha @AskAnshul @cricketaakash @harbhajan_singh @thebharatarmy @TheOnlyBrahma @murthyscribe #CovidIndia", "India continues to make news worldwide - of course for mostly wrong, terrible reasons..  👉Court threatens federal government over oxygen failure  https://t.co/P8Qj264bln", "@accountant_28 @ANI Well they did by not supplying the amount of Oxygen court asked them to supply after a mutual agreement. I believe the bedrock of democracy is rule of law which means we need independent judiciary. Once judiciary becomes independent of political winds we won’t see such deaths.", "@skjsni @IndiaToday Lakhs of Indians infected and thousands dying of Covid and no oxygen in sight and all the BJP chief thinks of is how to teach a lesson to Mamata Banerjee. Shame! Nation will remember the neglect of people.", "@PrachiPagaria @srinivasiyc @yuvahallabol @anuradhaxyz This hospital is not in Delhi. It’s in Pune", "Good evening @narendramodi @nsitharaman @PiyushGoyal @PMOIndia @FinMinIndia  How about using your powers to exempt ALL items that would be imported by charity organizations until the country has sufficient stocks of all the items that can aid the recovery of Indians in hospital.  https://t.co/tW506hZYH1", "#Ambulance #Bangalore #Mysuru #shivamogga #Tumakuru", "Be a super hero wear your mask. Masking is easy and cheaper than a ventilator. 😷🤣😂 #MaskUpIndia #MaskUp #MaskUpSaveLives #BreakTheChain #CoronaSecondWave #CDC #IPL #COVID #vaccination #LetsVaccinate #VaccineFor18Plus #vaccine  https://t.co/H7rPyW3eVl", "Can’t wait for times when all political  VIPs head to hospitals governed by them.... #Government-hospital", "ಆಕ್ಸಿಜನ್​ ಸಿಗದೆ ಬೆಳಗಾವಿಯಲ್ಲಿ ಮೂವರು ಸಾವು; ಆ್ಯಂಬುಲೆನ್ಸ್​ನಲ್ಲಿ ಒದ್ದಾಡಿ ಪ್ರಾಣಬಿಟ್ಟರೂ ಕೇಳುವವರಿಲ್ಲ  #Oxygen #Ambulance #Belagavi   https://t.co/76FQBoQI1J", "Just learnt from its SVP that @kghospital #Coimbatore has a critical oxygen shortage and needs 4K liters everyday.  Can you please help @india_oxygen @MotwaniSuhas @A10Rahul? Thank you.  #missionoxygen", "#SupremeCourtofIndia Declare National Emergency,,Modi incapable Govt unable to handle covid crisis...people are dying without oxygen.", "@BLRrocKS @kokolorixx @isha_pant Sir, I don't know if you have seen the fb video, apparently CT scan in Sanjay Gandhi hospital is free and takes no waiting time like Pvt hospitals which are charging 5 to 6k, here it costs just 120/150 rs.", "Panic and fear all around. Fear feeding fear. No oxygen. Deadly mutant virus. Vaccine kills. Take Remedesvir. No take steroid. No do this. Do that. Information without context or insight paralyses people.", "@maryashakil I request all citizens of India to not vote for BJP ...center increased oxygen quota after court stepped in, every second is important in respiratory distress and Narendra modi is playing dirty politics and literally killing citizens by not providing adequate oxygen despite(1/n)", "ಚಾಮರಾಜನಗರದಲ್ಲಿ ಸತ್ತದ್ದು 24 ಅಲ್ಲ, 34 ಮಂದಿ! ಅಧಿಕಾರಿಗಳು ಮಾಹಿತಿ ಮುಚ್ಚಿಟ್ಟಿದ್ದಾರೆ... #oxygen #chamarajanagara #covid #hospital #puttarangashetty  https://t.co/waEE3X7VVE", "@IndiaToday @AnkiitKoomar @Tejasvi_Surya , diverting chamrajnagar tragedy and other murder by govt to a communal politics isn’t the solution. You &amp; your govt are equally responsible for every death due to shortage of Oxygen or Medicine anywhere in Karnataka #DiaperSuryaExposed", "The central government has revised the covid testing rules to reduce pressure on diagnostic labs. Healthy inter-state travellers and Covid patients being discharged from hospitals after recovery must not be tested. #CovidIndia #Karnataka #karnatakalockdown #interstatetravel", "@Tushar_KN Body builders though considered to be fit and healthy otherwise could be at risk of Covid.Must be their Oxygen requirement being more to support their build up must be the reason.Whereas yoga emphasizes on surviving with minimal breathe.", "Log oxygen, bed ke liye tadap rahe hain. Saheb apne liye mahal banwa rahein hain.", "@tshahab05 No, doubt . It's very sad the @NitishKumar  Bihar Govt, Delhi Govt and Govt of India are equally responsible for his death . Chhota Rajan gets bed with oxygen in AIIMS and an ex MP didn't. What the hell these Govt are doing ? These Hinduvadi Sangathan and Govt have nexus against", "@UnkownYash @INCBANSAL Don't worry, they will not continue  https://t.co/rvB0FRNAMd is BJP propaganda. They just lost so they need to divert attention. Hundreds are dying in Delhi due to non availability of oxygen. BJP doesn't even care.", "@BlrCityPolice dear sir. Have an immediate family member who is in her 3 mnt of pregnancy. We are not able to go to hospital here in blr as all hospitals are covid center. Can I take my own vehicle and drop her to her hometown so her hospital consutn is taken care of. Pls guide", "@IndiaToday We, the people of India do not need nation wide dharna, instead we we need nation wide Covid help, oxygen, ambulances, make shift ICU beds, nurses, doctors, crematoriums and finally sympathetic government which cares for the people. Jadda saab have a heart, forget your dharna.", "We will push people into the vicious cycle of death. Unable to repay they commit suicides. Who will take the responsibility?  Drafting medical students to duty, Setting up oxygen plants, making medicines or aggressive vaccination does not need a lock-down.  (8/n)", "@avakava @_sabanaqvi His initiative towards humans dying in Covid is nothing to be happy about.  Its a sorry state of affairs in UP right now.  Shortages of oxygen shortages of beds.  Next election he will get to know the outcome of this covid mismanagement.", "@vikasbha Fraud news. Delhi hospital occupied my UP..", "@samyuktahornad @BSYBJP @DHFWKA @BBMPCOMM @MoHFW_INDIA But they are not asking for refueling of oxygen why? Why shifting to other hospital? I could agree if they written refuel it or shift patients.", "Oxygen: Supreme Court To Hear Today Centre's Plea On Delhi Court Order", "Bed booking Mafia in hospitals being exposed by Bangalore South MP Tejasvi Surya. It is shocking!!! 😡  https://t.co/XynKNrxE8a", "PLEASE REGISTER ON THE CoWIN APP for your vaccination slot.   TAKE AN APPOINTMENT FOR vaccination prior to visiting the hospital. We will be able to vaccinate you as per the appointment slot and as per applicable Govt’s regulations. #COVID19India #COVID19Vaccination  https://t.co/46MgIkYaNs", "Bangalore Medical College : Rank 10 -12 Victoria Hospital Bangalore Karnataka India.  https://t.co/OC1dJgF2pZ", "@Tejasvi_Surya 2nd May 9 PM we had the same situation. Not sure if you were ignorant of the data.   All politicians should spend 12 hours at Victoria hospital to know the ground reality.  https://t.co/8Vxp4Et8jD", "@HinduismReal @HybridMafia99 @KanganaTeam how many came after 2014? just building hospitals wont help you, you need doctors, nurses, para-medicals. Things have speeded up after 2014. Temple building esp. Ram temple is very important to reclaim a part of our history.", "A hospital in B'luru is running out of oxygen. After an SOS, the Deputy Chief Minister tweets that supply will be provided. Volunteers have also reached other to others including KPCC President DK Shivakumar. So far only 15 small cylinders have come, that too from volunteers.", "@raag185 @rahulgrover88 @narendramodi vaccine hesitancy is fig leaf of an excuse? was it? There was concerted effort to discredit the vaccine till feb 21 by media &amp; political leaders. Which astrologer told you that the second wave will be terrible and oxygen will be required?", "Varun Dhawan Partners With An Initiative To Procure And Donate Oxygen Concentrators   https://t.co/fdBvMkJpr8 #varundhawan #akshaykumar #sunielshetty #aparshaktikhurana", "@hippierani @yadunandan171 @BengaluruSOS @WeAreBangalore Yes 3 hours back....can you check it out now please? Call the hospital....", "@blsanthosh @BJP4India 24 Patients Die In Karnataka Hospital Allegedly Due To Oxygen Shortage  https://t.co/V8KR6iimvg", "@Geosundar07 @Sriganesh012 @skpkaruna Antha amma CK hospital owner.. Athu epdinu STD paththave therium.. Then ippo new face fr BJP now WIN.. +- paaru results therium..", "@tw_100rav @miss_tvis @TimesNow @AamAadmiParty Precise reason why funds were allotted in Dec 2020 to build 8 oxygen plant. Out of which only one was built", "@timesofindia Next the DL govt will say.... train se utarva ke hospital tak le jane ka kaam bhi center ka hi hai.. and will file another case for this in HC and SC", "@BBMPCOMM @Randeep_Dev Sir learn from @mybmc ..they have brought down cases to 2k as of today, while BBMP is involved in corruption where fake bookings are made to block ICU beds, oxygen hoardings.. there will more lives lost... please control corruption mafia", "CBI KNOWS WHO KILLED SUSHANT  #BREAKING NEWS  #Khelahobe   #khelahogaya   #RajeevMasand’s condition critical, on ventilator after corona infectionGradually, his health deteriorated and the oxygen level went down.    @RTQUEEEEN679 @mamta_kale @IStandWithSSR @itsshilpasamai  https://t.co/YzIc08J6fv", "@Tejasvi_Surya Situation out of Control, so many people asking for ICU BEDS, Oxygen etc. BJP karyakarthas become helpless.🙏", "The second dose vaccination slot for 45+ is available in lot of places across Bangalore. Almost all pvt hospital slots are booked but many open in PHCs.", "How insensitive the administration must be to tell COVID patients asking for oxygen to sit under a peepal tree! State of affairs in UP.  https://t.co/lvFZYmjFZE #CovidIndia", "How many BJP ministers have gotten treated at @moayush hospitals for Covid , so far ? Can you please share the numbers?", "Are Oxygen plants not essential in the courts ?", "@NZinIndia @smitadeshmukh Why do you need Oxygen cylinders? Have you approached @GOI ?", "@ril_foundation @Suhelseth @RahulGandhi you need to atleast thank them now... twitting does not generate oxygen for life saving ... actual work on ground does... industrialist are doing it selflessly for the country irrespective of your constant unwarranted targeting", "COVID-19 surge: 22 deaths in Chamarajanagar triggers anxiety of oxygen shortage   https://t.co/SxxeyAY8jn", "Vaccinations process in all hospital center s should immediately stopped, ward wise door to door vaccination through medical van procedure is a good solution, cloud of people is very dangerous in Covid19, un satisfaction with govt arrangements will also down...", "@PratapReddyC @SPBelagavi Everyone across India is doing their best to ensure Oxygen reaches hospitals as fast as possible But in Belgaum, Police is Blocking all roads and not even allowing Vehicles carrying Oxygen.  Baracads should be opened for Ambulance &amp; Oxygen transport Vehicle's at least.", "Bengaluru hospital runs out of medical oxygen, two patients die #Bangalore #Bengaluru #OxygenEmergency   https://t.co/Vbin1KJ5Om", "When I wrote this book in 2019, I didn't realise what 2020/2021 had in store for the whole world.   This story helped me explain #death to my child, helped him picture a damned ventilator..buy it if you can or read it for free on StoryWeaver. #kidlit    https://t.co/dgBJu6FbO0", "@bkpandeyg Chal chal jab rally huyi us waqt sefety and security kaha gayiin thi. Bolo agar bhakton ki jalrahi hii toh barf ki silli bhijwadeta hoon unko. Oxygen se aag lag jaayegi😀😀😀pichwaade mei.", "@velumania In these times, 1500-3000 rs will count as incentives?  Can they assure them that in addition to that they will be entitled for guarnteed oxygen and hospital beds?  Or that is the perk reserved only for our Sewaks and Chowkidaars?", "@atti_cus @mpk_prabha @srinivasiyc In the video the NZ PM is also acknowledging the err in reaching out to other channels rather than official channels and hence they removed the tweet as well. Are you guys, sane? And show us the tweet where MEA has said there were no requirement of oxygen cylinder at NZ embassy?", "Atleast someone is there to make them accountable. #HighCourt  #Oxygen", "One picture = thousand words #aap #delhi #covid #oxyg #oxygen  https://t.co/BALVn5iQjU", "@BBMPCOMM Why bbmp is asking private hospital not to give vaccine to below 45 years even if they are ready to? What's the politics here? @BBMPCOMM", "India need oxygen #indianeedoxygen  Third consecutive donations for oxygen supply . #COVIDEmergencyIndia  #COVID19India  https://t.co/ogCV28Xreh", "@worldofsanjeev Right now, no oxygen cylinder is being delivered without a valid prescription because of the huge demand. And Gauti was also distributing FabiFlu against a prescription", "@karavallihuduga @Yardbirdie Hey Gautham, patients can be admitted to hospitals and treatment can commence irrespective of the RT-PCR being negative. Please call 1912 and explain this is a SARI case and that the patient needs to be admitted and a BU Number needs to be generated.   https://t.co/Z1fP1LEJ1C", "@DVC2095 @priyankac19 @Bhawna18 It has hit us twice. We got enough time to prep but still Govts across did nothing. Same set of problems..bed availability, Oxygen cylinders, ICUs, Lack of medicines...No vaccination! How do we win?", "@narendramodi we need a lockdown to improve the supply chain of oxygen, reduce caseload, give time to build makeshift hospitals, import medical equipments for more ICU beds. Why are you not listening? Bravado? Ego? Hubris? You are our leader please be better than this.#covid19", "@Rjtravel123 @prakashraaj @narendramodi The picture shows reality.  What the govt has prioritized : Central Vista as essential services   And what our real priority is : oxygen  .. .. Very powerful picture showing truth.", "Yet, hospitals and families continue to make desperate appeals for oxygen on social media, while the status of the emergency supplies remains unclear....  https://t.co/B0VAICQac0 via @scroll_in", "@ShamikaRavi @kiranshaw @ICMRDELHI @MoHFW_INDIA Also, Vaccination (especially by private hospitals for 18-44yr olds) NEEDS to be done in Open Grounds with Social Distancing being strictly followed.  🙏🏼", "Thank you for your explanation. Earlier was easy with panic in crowd, we just walked in completed registration process paid and got vaccinated. For 2nd dose due, same hospital said BBMP withdrew all stocks and they are waiting circular with further instructions.", "@SushilModi My deepest condolences. But he died bcz of your SYSTEM and not Corona. When poor people are dying due to shortage of oxygen and hospitals bed you are saying its because of system so system will haunt you, your familie and people in power.", "@beingsatyavadi @BbmpsplHealth @narendramodi @PMOIndia Thanks so much for your help and support. Finally got the bed in St John's Hospital", "@PMOIndia Respected Sir Pls call India Corporates and ask them to manufacture oxygen concentrators asap and sell in the market. The cost of the O2 concentrator to be reasonable. So that people or a group of people can buy to save lives.", "@Arnava30 Dude don’t forget 37% of Keralites depends higher studies for Karnataka.  Secondly 60% of kasargod border people depends on hospital in mangalore.  Finally Kerala Chief ministers daughter IT company 100% depends on Bangalore.", "@Tejasvi_Surya sir ambulances and some hospitals are looting money it would be great help if you can help in controlling these issues!", "Inefficiency Of This Government To Provide Oxygen Has Resulted in Death Of Innocent Patients Affected By Covid.  The Complete Blame Goes On You Mr. @BSYBJP and Mr. @mla_sudhakar .  Resign If You Have Some Humanity Left!  #ResignSudhakar  https://t.co/P2LUZ1vxxV", "@dheeshar45 @LtGovDelhi @PMOIndia @narendramodi @narendramodi_in @KailashHealth @fortis_hospital @TajinderBagga I know bhai same boat!!!", "Oxygen shortage: 12 Covid patients die in Chamarajanagar district hospital in Karnataka  https://t.co/JdgPJfrXKH via @bangaloremirror", "@anubhavsinha we the people are responsible to take out our country from the crisis. But we are the real vulture and we are eating ourselves. We are stocking oxygen,medicines, we are charging 10 time more on ambulance... Manavta mar gayi hai lobh k chakkar me..", "@anandmahindra That is the reason I'm requesting with you to have small oxygen plant in every district to reduce cost as well to save lives.", "The people who are getting covid are dying due to the lack of oxygen, those who are not infected by covid are dying because of financial troubles. @PMOIndia @nsitharaman @BJP4India @RBI @indSupremeCourt please #helpmiddleclass #weneedmoratorium #moratorium3.0", "@BSYBJP BSY it's joke of the day ask any of the DHO how many times he has visited the hospital in his area and you are talking about isolation medicine oxygen which is not in their priority list at all their priority is totally different you should have discussed about it.", "Recently,d K'taka Gov procured 3 addnl plots on d outskirts of Bengaluru 2 b convertd into Open makeshift crematoriums. If this vision less Gov had invested in more Hosp infra &amp; Oxygen plants, they wldnt hve 2 invest in cremation grounds... Each life is precious! #ResignSudhakar  https://t.co/YU1TYZC6kC", "So one guy promises home delivery all over India for oxygen cylinder. I ask in Delhi to deliver but won’t come without advance being paid. Wont give option to come pick up. Smells like scam. Frauds doing such stuff during calamity.", "@DrKaloo @sanjeev101170 Good information on oxygen Dr", "Things to consider while buying an oxygen concentrator", "@shubham_js_ @surajj221401 @idnani_nandini @narendramodi Coming to live CM conference when he did Rama that Modi ji Mujhe oxygen de do. When he was given oxygen plant money in November 2020 all he did was to make one plant Uttarakhand and Himachal made 4 and 5 each", "#JUSTIN - Indian Naval Ship Talwar, the first ship of Op Samudra Setu II entering the port of New Mangalore in Karnataka with 54  tons liquid oxygen  from Bahrain embarked.  @AsianetNewsML @indiannavy  https://t.co/6ph68FS4Qq", "@SakshiRaghuwa14 @SushmaSwaraj @governorswaraj @BansuriSwaraj @narendramodi If Sushmaji were to handle Covid pandemic, she would have strengthened family physicians net work, attached families around to this Primary Care Center’s as UK, attached These PCC to local hospitals &amp;given Ayushman Bharat Insurence to every resident Indian", "@abhinxx I bought 2 oxygen cylinders from peenya gas 1 leaked the second is also leaking .The guage has become defective.Need refilling &amp; new guage pvkraman", ",You can put your head in sand like ostrich, we won't': HC slams Centre over oxygen shortage  https://t.co/JYE2cK9YF0 via @timesofindia", "@WoodSenju Excuse me where is all that “Several MTs” of oxygen 24 ppl died in same hospital due to lack of oxygen. Multiple hospitals require oxygen and government is not doing anything! Individual volunteers are trying to procure and help. None of the BJP ministers are receiving calls.", "@BannaGupta76 Worst health minister of the country. Neither oxygen cylinders available in state nor icu beds are there. Mismanagement by state govt.", "Non Supplying Of Oxygen To Hospitals Is Criminal Act, Not Less Than Genocide By Authorities : Allahabad High Court  https://t.co/mOXEmunpo0", "CBI KNOWS WHO KILLED SUSHANT  #BREAKING NEWS  Film journalist #RajeevMasand’s condition critical, on ventilator after corona infectionGradually, his health deteriorated and the oxygen level went down.   @RTQUEEEEN679 @IStandWithSSR @mamta_kale @Pari12345666  @nagda_rupal  https://t.co/fZDIGsZieJ", "Opinion - Who are these Indian anti-vaxxers refused to take vaccines? - How do Anti-vaxxers Influence people? - Lack of vaccination leading to a surge in covid cases and oxygen shortage. #VaccineNaysayers  @moronhumor @MeghUpdates   https://t.co/3Nc7PHF646", "Thank you. @ril_foundation Traditionally, Reliance is not a manufacturer of medical grade liquid oxygen.Yet, starting from nil before pandemic, Reliance Industries has now become India’s largest producer of #OxygenForIndia   https://t.co/ombcP7k8oI", "@ShakuntalaSahu0 Madam aisa nahi hai ki private hospital wale jaan bujhkar marne ke liye chor de rahe hai aur ye argument wahiyat hai sach bola jaye to please kuch soch samajhkar likhe waise hi time bhot najuk hai....", "@coolparam007 @rakeshdhar @BJP4Delhi 162 Oxygen plant to be installed by Central govt,ordered in Jan 2021 though PM Care funds.but only 33 installed till nw all over the country.. will u ask to central govt for this??? Now again 550+ ordered..god knows when it ll b installed in real.", "24 people die in #Chamarajanagar Govt hospital due to shortage of #Oxygen  This shows the failure of the government @BJP4Karnataka  RESIGN @BSYBJP @mla_sudhakar  It's so evident that you have utterly failed the public. #COVID19 #Karnataka #bangalorecovid", "@KasthuriShankar @mkstalin They should not make the same mistake the Centre did by not planning. First, set up surplus beds in hospitals and other places. Order vaccines for the next 6 months. Have a huge stockpile of Oxygen in warehouses in TN. Involve NGOs in relief for the poor.", "Lack of oxygen and lack of medical support to a citizen.  Don't this amount to gross human right violation ??   #Chamarajanagar #KarnatakaFightsCorona", "Great work Sir. But a relative of mine (staying off Bannerghatta road) tried for an O2 bed whole of last night only to find it in a pvt hospital 30+ kms away in Peenya. On every call, the BBMP person kept saying that bed will be available only when someone is discharged.", "@BangaloreMirror Is it really the hospitals fault if there is no supply of oxygen, doctors are working selflessly, we should motivate them", "@IndiaToday How can we trust our families with BJP leadership during Covid epidermic when they think how to win elections? Where is the oxygen for our fellow citizens in Bangalore? Karnataka is a BJP ruled state. Where are the make shift hospitals? Where is the firewood to cremate the dead?", "@jigiddikilladi @pepsiwithastraw Hi. My grandmother too. And we've been managing it at home (my sis helped set up an ICU). In case you want someone to take a look at her reports to make sure you don't have to run around for hospital/bed, etc, pls let me know. I'm saying this without knowing her case at all.", "Compliments to our @indSupremeCourt for their relaxed approach to the oxygen crisis in Delhi. Today 12 died in Batra hospital and Bhagat Hospital with ten critical patients has run out of oxygen. This is in the backyard of our venerable leaders @rashtrapatibhvn @VPSecretariat", "Just spoke to the Control Room (Bangalore) again to find out about the reason for the delay in supplying Remdesivir doses to the patients at hospitals that have requested it.  This is what I have been able to find out. 1. The Control Room helpline only accepts incoming calls.", "Hi! There is a shortage of oxygen  at @Pinnacle hospital Bangalore. They are asking patients to shift.  Also hospital is not giving any updates on patients condition. Can someone help? where should we go now?  @Tejasvi_Surya @nistula @srinivasiyc @dhanyarajendran @DgpKarnataka", "@MarthaVotesBlue @RhondaResisting @good_jarvis4 @Tenenbaum1017 @Gemini21BLM @katibug817 @CuriousReturn @Victoriagatoll1 @showgirlcf @KingRezizt @Bedlam_Squatter @j_boucher24 @Juliethewarrior @MP_LatinX @PissOffTrumpz @elvia_espi @MichaelChrisLA @ZACKHAMMER7 @rexzane1 @BadBradRSR @ICEMANBOVEN @sweet_iced_T @jackie14916195 @cate_fox2000 @coralgableswang @PmurtTrump @doxie53 @TemeculaRises @Giannieternauta @oXxRowanxXo @Urtoez75_2 @LennyChevere @1988Vor @BrianHarris33 @ironmanpetey @GrandMasterE1 @ray_osa @nairjenny2 @gabby_UCMaroon @Pzeedrummer9 @dad_darius @jnorthern29 @Andie00471 @ianbaer @CypertRobyn @QuinnLeone4 @LisaLmperry13 @NastyBastard60 @koolkaryn It's like a hell govt of people no oxygen no bed no blood no remedivastsar no vaccination really frustated", "@BSYBJP @BJP4India @PMOIndia @narendramodi   We need green corridor to deliver oxygen  https://t.co/ZkMaJwACB5", "Now lakshmipathy is admitted in hospital😂😂😂#CSKvMI @SPFleming7 @ChennaiIPL @mipaltan", "ಆಮ್ಲನಜಕ ಕೊರತೆಯಿಂದ ನಾಲ್ವರು ಸೋಂಕಿತರು ಮೃತಪಟ್ಟಿರುವ ಪ್ರಕರಣಕ್ಕೆ ಸಂಬಂಧಿಸಿದಂತೆ ಕಲಬುರಗಿ ಜಿಲ್ಲಾಧಿಕಾರಿ ವಿ.ವಿ ಜ್ಯೋತ್ಸ್ನಾ ತುರ್ತು ಸುದ್ದಿಗೋಷ್ಟಿ ನಡೆಸಿ ಸ್ಪಷ್ಟನೆ ನೀಡಿದರು.  #Kalaburagi #Afazalapura  #hospital    https://t.co/PlcnOkfYt9", "@nradhakn A friends company donated 20 Oxygen concentrators from US via International courier, stuck since May 1st at Delhi customs. Chennai guys are supposed to go to Delhi to clear it. I keep reading similar stories in social media.  https://t.co/dVEOgtlADt", "@PMOIndia @AmitShah @CMofKarnataka @blsanthosh @mepratap @RAshokaBJP @BSBommai @deepolice12 @DgpKarnataka @nimmasuresh @drashwathcn @mla_sudhakar  Provide all the govt hospitals tight police protection,thr are chances of political game plans to trouble govt by troubling patients", "@PrachiPagaria Thank you Prachi. You have been of great help. God bless.. They found a bed at an hospital in Kengeri..", "@Shruthi_Thumbri @BBMPCOMM @Tejasvi_Surya @mepratap Had similar situation 4days ago...look for bed with only oxygen facility...", "The #COVIDSecondWaveInIndia has overrun hospitals &amp; even crematoriums. In our latest episode of Notes to Self series, we talk about celebrating the lives of those we've lost, &amp; giving ourselves the room we need to grieve.  Listen here:  https://t.co/HaDRRyj2PI  #podcast  https://t.co/cauh2j1jzT", "So far the patient has not got a ventilator. One hospital has come forward to admit them provided they can get a ventilator setup as they don't have it. Any leads or help? @BBMPCOMM @srinivasiyc @RakshaRamaiah @Bkrs_Rakshith @dp_satish @Captain_Mani72", "@Sonal_MK  UP MLAs want beds in Delhi hospitals", "Some pandemic lessons:  1. We can WFH 2. Home food makes you healthy 3. We can build hospitals within days 4. Family is so important 5. Rich and poor equally vulnerable 6. Shopping is not important 7. Fear of the disease is also a disease 8. Heath infrastructure has to improve", "@IAnnapurnna Yava aaspatre li kodattiddare ? Name and pincode of hospital pls", "@TimesNow @Tejasvi_Surya Congress in Karnataka launched free ambulance services. Pls cover that also.", "State Government Of Karnataka is irresponsible, Deaths due to the Lack of oxygen is indirect murder of citizen.  Highcourt must intervene in this issue. @BSYBJP @mla_sudhakar @nimmasuresh @CTRavi_BJP  #ResignSudhakar #ಆರೋಗ್ಯಮಂತ್ರಿ_ಸಾವನ್ನೇತಂದ್ರಿ  #ResignBSY #CampusFront", "MANDATORY INSTALLATION OF OXYGEN PLANT IN ALL HOSPITALS ABOVE 50 BEDS - Sign the Petition!  https://t.co/BZv9JlhzQZ via @ChangeOrg_India", "@BDUTT @washingtonpost Did you also add that you were irresponsible in not getting him vaccinated, nor taking him to hospital on time?  Offcourse,  even that GOI had to do as you were standing next to pyres! Disgusting, the levels to which people go?", "@SriSri_Hospital @AOLSwamiji @nishamanijgd @jainajgd @sharmilajgd @manijgd @charuandguru @CYogeshwar The statement looks like drinking ice cold water helps make the vagus nerve better. YOu wanted to convey opposite. Pls rephrase. Or its just me ??", "@bahardutt @UnSubtleDesi We trust the Covid report, but why did your sister lie in front of international media that Oxygen wasn’t available in the Ambulance???  Why did she delay his admission in the hospital???", "Son gives up hospital bed for father's treatment in Noida | Noida News - Times of India  https://t.co/aBLiqsuSIo", "@ANI BJP leaders setting up private hospitals and using foreign equipment and collecting bills in Dollars", "Where are the oxygen cylinders, trucks, trains, plants &amp; that which came flying from other countries?@MoHFW_INDIA @narendramodi @BBMPCOMM @PMOIndia @DHFWKA", "@OpIndia_com @rahulroushan @raghav_chadha you must be Happy that your Govt Locked a Running Oxygen unit with a capacity of 500 Cylinders a day.   You shameless Vultures", "The State has decided to import five lakh vials of Remdesivir and one lakh oxygen concentrators to tide over the COVID-19 crisis.  https://t.co/KSAxGJCjlJ", "@timesofindia No. This time it was not lack of oxygen   Till how long will people put up with this suffering", "@PMOIndia @NitishKumar  where are you hiding? Aren't you aware that people are dying here in bihar? No oxygen, no beds, no medicine, no doctor,. Everything has crashed. Only the life of people living in other states matter? What about bihar, nitish u will pay for all of this", "#JusticeForRohitSardana He is not a PM or CM to give special observation or give VIP treatement. All our medical staff across nations are handling multiple covid patients.  This is not failure of any hospital or any medical staff. This is the failure of @narendramodi govt. 1/2", "KBN Hospital Kalaburagi informed  that the Oxygen supply for patients will get over in couple of Hours. They have asked all patients to make their own arrangement. @mla_sudhakar @BSYBJP @UmeshJadhav_BJP @GulbargaLive @publictvnews @BJP4Karnataka", "@ndtv Where is the oxygen came from US, Germany, England etc", "@narendramodi ‘s central team is unable to supply data to the court in time.can you trust this government to do anything worthwhile? Let alone supplying oxygen as required. While his dogs/bitches continue to Yelp...", "@bkolleri @rahulgrover88 @narendramodi \"vaccine hesitancy\" is a figleaf of an excuse. Advance order for vaccines were supposed to placed in 2020 itself.  So, some astrologer told him in 2020 that there will be vaccine hesitancy? did the same astrologer also tell him that oxygen won't be required?", "@FaheemYounus   Are these oxygen cans useful?   #oxygencans  https://t.co/gvyRUKNsJQ", "Newly bought OnePlus watch doesn't connect with OnePlus 7. Customer care is unable to fix the issue. No Return policy only replacement available.  Build Number: Oxygen OS 11.GM57AA  Bluetooth Version:  2.2.2  @oneplus @OnePlus_IN  #OnePluswatch  @OnePlus_Support", "#Bengaluru with over 3 lakh cases, has been struggling for sufficient #oxygen supply; people have been struggling to get hospital #beds. Now for them to know, beds were available all along but not allotted, it will be extremely disturbing for the families who suffered.", "@BajithKarayi @sayantansunnyg First count how many got saved in those same hospitals due to oxygen and then count those dead due to lack of oxygen. Then you will get the correct figures. Its always easy to highlight only bad as always like you people do it every day...", "@PiyushGoyal Then how come hospitals don't have", "Dear government!  The 24 people who died in #Chamarajanagara died on BEDS!  the issue is with oxygen!  Please please please address this!", "What is left of a government whose expose is also filled with bigotry and communal filth! This at a time when the state is registering highest number of cases and patients are dying due to lack of oxygen in hospitals.", "@Absnair @SaffronSurge3 @jassy_Phoebe @SuryahSG @VanathiBJP @ikamalhaasan Yes. God saved CBE from aandavar.. Hope aandavar finds a suitable place to generate oxygen replacing sterlite industries, after being part of all party consortium reaching consensus..before next assembly elections", "@Arun2981 @devashishji @naveenjindalbjp @ArvindKejriwal Abe tuje kuch nhi pata apna muh band kr do kodi ke chaman chutiye oxygen plant chalu karwao koi ....black karne wale ko jhel bhejo pr plant chalu karo", "@sabyaactor Hello Bhai, oxygen required urgently at berhampur for my relative, any kind of help is appreciated", "Ideally the logistics of oxygen transportation can be handled by Railways and Postal along with health dept. They can only manage this scale and have footprints everywhere. #OxygenExpress #Oxygen @RailMinIndia @PMOIndia @MoHFW_INDIA @timesofindia @IndiaToday", "Dhoondh is now using their platform to find and share #Oxygen as well.   https://t.co/TtHn7NK415", "@aadil This is for oxygen only.", "Indians flood social media with #SOS calls for #oxygen &amp; #medical aid amid #SecondCOVIDWave, but #Modi's ministers are thanking him—constantly.  https://t.co/WtkXi5nGKj", "Oxygen concentrator, Ventilator, oxygen, Remidisivir injection, medicines, mask, PPE Kit everything is coming from foreign countries then what for MAKE IN INDIA #narendramodi  Ji only under this Bhakts were produced ? Andhbhakt ?", "@rupahasit @smritiirani @vijayrupanibjp Do you think are they going to take care ? Day before yesterday at Delhi, then Bangalore then Kanpur total around 50 persons are died due to non supply of oxygen, Gujarat CM is saying it's better but still no beds, no oxygen, no ventilator", "@deepti__sinha Centre obviously! Conducting huge rallies and thus sending WRONG message to common people. Wooing voters for their miraculous clutch on first wave! And loosing the entire hysteria show due to lack of oxygen and hospital beds! Wah M*** ji waah!", "@Tejasvi_Surya @CPBlr please see this hospital charging 40000 covid package when patient only needs to arrange oxygen in sarjapur road Bangalore. No breakup given  https://t.co/m1skxLE0et", "@bhukkhad Government centres here only have 45+. I had a legit appointment at a private hospital.  Slots kyun open kiye vaccine nahin dena tha toh!", "And that joker @ysjagan backed by another failed person #FailedPMModi barking like no one has died, beds are available, no deficit of oxygen, 24/7 ambulance services, etc... Etc...", "ಕರೋನಾ ತುರ್ತು ಪರಿಸ್ಥಿತಿ ಘೋಷಿಸಿ, 6 ತಿಂಗಳು ಎಲ್ಲಾ ಖಾಸಗಿ ಆಸ್ಪತ್ರೆಗಳನ್ನು ಸರ್ಕಾರದ ನಿಯಂತ್ರಣಕ್ಕೆ ಪಡೆಯಲಿ – ಕುರಬೂರು ಶಾಂತಕುಮಾರ್  let declare #COVID19  as a #medicalemergency, and take over all the private hospitals into the government control -Kurubur Shanthakumar​    https://t.co/CDFIohGGqI", "ಪೆನ್ಷನ್​ ಉಳಿತಾಯದ ₹4 ಲಕ್ಷದ ಜೊತೆ ಲೋನ್ ಪಡೆದು, ಆಸ್ಪತ್ರೆಗೆ ವೆಂಟಿಲೇಟರ್​​ ದೇಣಿಗೆ ನೀಡಿದ 65ರ ವ್ಯಕ್ತಿ   https://t.co/JwTD8MCyQZ  #newsfirstlive #Ventilator #Hospital #Covid19 #CoronaSecondWave #CoronaVirus", "@BSYBJP Sir, let there be a scientific basis for allocation of Oxygen, based on number of occupied beds/case loads. There are many Hospitals in our hinterland, from where there won't be any vociferous voices, that doesn't mean there is no need of oxygen there.", "#India’s #top_court gives govt till Thursday morning to provide plan on supplying Delhi hospitals with oxygen amid shortages••••   https://t.co/w73krTcgqg", "@CMofKarnataka this a crime. Where is the oxygen is any one holding it?", "As the city gasps Delhi's elite buy and hoard \"home\" ICUs, oxygen and other life saving medical supplies  https://t.co/ppDHhPr0og", "@ravithinkz Then they will come up with a new rule saying: every hospital should have two oxygen generators.", "@TimesNow @Tejasvi_Surya Same thing must be happening in other places too. Delhi's crisis for bed, medicines and oxygen too give suspicion.", "The feathers will drop! What about the gross mismanagement by the political leaders in the centre ? @narendramodi @AmitShah pls provide an account of the money spent in West Bengal election and why not in a hospital?", "My sources just informed me that, since a week there would be no oxygen supply for one or two hours. But yesterday for 4 hours there was no supply of oxygen at all. After this docs declared almost 16 people as dead. What enquiry drama is govt still doing when docs know the fact.", "@_pallavighosh He only meets. Outcome is waste of oxygen", "@farzikadhakosla In this crisis, I came to know that hospitals, oxygen plants and any infrastructure can be built within one month. But these people (BJP govt) did not do this. They always behave like opposition which is more annoying.", "@madnavin Do you recommend going the private hospital route? Is the process same as cowin?", "Shocking news from Chamrajanagar District.  24 people have died due to no oxygen at the District hospital.  Criminal negligence by @BSYBJP and @mla_sudhakar.  The health minister should be made accountable for this tragedy.  He should be forthwith removed from the ministry.", "So how many deaths due to lack of oxygen &amp; murder by govt will be hided in the name of bed scam ?  Diaper boy @Tejasvi_Surya must answer this !! #DiaperSuryaExposed", "Sir Iam covid positive patients when I finish 14 days quarantine under supervision of Haptamitra government of Karnataka after that I go for second test hospital authority say we are not supposed to do it second test now you tell me sir without negative report company not rejoin.", "Vaccinations process in all hospital center s should immediately stopped, ward wise door to door vaccination through medical van procedure is a good solution, cloud of people is very dangerous in Covid19, un satisfaction with govt arrangements will also down...", "Who Is Responsible For Chamarajanagar Incident: UT Khader Question Govt....  https://t.co/3PGwMjncot #Chamarajanagar #UTKhader #Oxygen", "@PiyushGoyal 24 deaths in one of the hospital of karnataka in one day. Where you are sending? Patients are dying without oxygen everyday.    https://t.co/o2atWklAxA", "Hospitals in Vijayapura district are full with corona patients  Video Link► https://t.co/0FbX3nbrJH  ವಿಜಯಪುರ ಜಿಲ್ಲೆಯ ಎಲ್ಲಾ ಆಸ್ಪತ್ರೆಗಳು ಕೊರೊನಾ ಸೋಂಕಿತರಿಂದ ಭರ್ತಿ, ನೋ ಬೆಡ್‌   #TV9Kannada #Vijayapura #Hospital #NoBed #Oxygen #Coronavirus #covid19 #Karnataka #Coronadeath  https://t.co/Z9zRViMAiJ", "@chaithuammu @CovaxinVaccine You can try to book through Cowin in any Government hospital or can directly walk in. Vani Vilas and Victoria Hospital currently have Covaxin stock. Even Manipal hospital, old airport have the stock but it is dynamic and need to check daily.", "My girlfriend from Philippines 🇵🇭 asked me today why is your government not providing oxygen to people who are dying. and i.. I have never felt so embarrassed about living in India. I think I should not talk to my international friends for a while. It’s just awkward &amp; mortifying.", "There will be no Covid19   No Oxygen shortage from this evening  Even @BDUTT 's dad will return safely to watch his daughter's videos showing cremations of other patients  #ElectionResults  #WestBengalPolls", "Midwives play a vital role in providing health services. T We at IIRRH want to take a moment to thank midwives around the world for the work they do. Visit:  https://t.co/gKlbebov8A #midwifeday #InternationalMidwifeDay #midwife #nursing #healthcare #hospital #care #pregnancy  https://t.co/vTBIYkzLjH", "@MysoorunewsC @MysuruMemes @DChamarajanagar @chnpolice @nimmasuresh @KarnatakaVarthe @CMofKarnataka @mla_sudhakar @mepratap @bjpVSP @BSYBJP @CMofKarnataka @drashwathcn @mla_sudhakar @Tejasvi_Surya @nimmasuresh @DHFWKA @BBMPCOMM wat was war room doing didn't DC complaint ABT shortage of oxygen govt shld monitor district oxygen levels daily all DC or DHO shld report available n need of oxygen on daily basis so", "24 patients died at a government hospital in #Karnataka’s #Chamarajanagar dist. Hospital on Sunday due to #OxygenShortage, reportedly. \"The deaths were reported after there was a fall in oxygen supply.\" @narendramodi @AmitShah @nsitharaman @drharshvardhan @rajnathsingh @BSYBJP", "@Tejasvi_Surya @TajinderBagga Kindly work on getting Oxygen for hospitals. Disappointed with Modiji. And lack of organisational inefficiency!", "@awasthis @pankajjha_ @romanaisarkhan @manogyaloiwal @Kuntalch @dibang Do you know in one of Delhi's children hospital oxygen is running out ,, and you continuosly showing election results ,, such an hopelessness @RubikaLiyaquat", ".@CMofKarnataka holds high level meeting on oxygen manufacturing, supply, stocks. @IndianExpress @XpressBengaluru @santwana99 @DHFWKA @CovidKarnataka @WeAreBangalore @NammaBengaluroo @NammaKarnataka_ @BBMPCOMM @namma_BTM @Namma_ORRCA @BellandurJothge @SarjapuraRWA @IChangeMyCity  https://t.co/D3pbMu6Ncq", "Why do we don't have enough oxygen ? This is why 👇🏽", "Hence proved, the government can only organise rallies and public programmes not oxygen, 24 peoples have lost their lives and still our health minister @mla_sudhakar is nowhere to be found, your acts will be remembered as a mass murder. #ResignSudhakar #ResignBSY #Chamarajanagar", "Why there is lack of oxygen in Karnataka. 20+ patients died in district hospital, seems like now BJP taking revenge because people of Karnataka didn’t vote for BJP. Everyone knows how BJP formed government in Karnataka. @srivatsayb", "@PMOIndia @tv9kannada @republic @ZeeNews @publictvnews @CMofKarnataka This Karnataka govt is playing with public life. This govt is responsible for chamrajnagar death of 24 people due to non availability of oxygen. This govt is totally failed hence governor rule is must here.", "@DrSenthil_MDRD Sir, In palacode they newly constructed Woman and child govt hospital near police station... It's not use as of now..", "No Lockdown No oxygen No Ventilator No Hospital Bed No ICU No Ambulance No Crematorium   Yes Election Rallies Yes Road shows Yes Cricket Stadium Yes Parliament Vista Yes Amusement parks Yes Bullet train  Yes Statues Seaplanes  Using Pandemic as an opportunity Comes true !  https://t.co/WunBkC58Dv", "@ARanganathan72 @TimesNow @RShivshankar We have moved beyond PPE kits/masks/sanitisers now.  Virus is  in the community now.  Oxygen/medicines/ventilators/icu etc and their supply chain are the indicies of preparedness now   If we are not well equiped un theses-Lockdown is justified 2/n", "@dineshgrao @BSYBJP @mla_sudhakar Rather than coordinating with the state team incharge with the distribution &amp; supply of oxygen, would they say \"No\" if you provide them with the list of hospitals in your Ward having supply issues. Try to help others in need as you are in a position to help rather than tweeting.", "@NitishKumar Accha aisa kya? Log bina oxygen k mar rahe hain uska kya?", "Hospitals were full and she was being treated at home. And this morning her oxygen levels just dropped. This is just so frustrating for me. I just want to say that I will always remember you and I hope no one has to go through this.", "\"Oxygen Stopped\": Families Allege 4 Deaths, Official Denies Charge", "Had written this on Apr 24. Ten days have passed but still no clarity abt vaccine availability. People are visiting hospitals everyday. Whts the problem is setting up a war room to give right information to public?   @ShobhaBJP @mla_sudhakar @BJP4Karnataka @Tejasvi_Surya  https://t.co/GuGbP0GjFR", "Arvind Kejriwal's wife admitted to Max Super Speciality Hospital in Saket. Best wishes for recovery.  And Aam Aadmi Party kept showcasing its 450+ Mohalla Clinics in ads across India, using Dilli's tax payer money.  Now you know for whom Government hospitals are...", "@IndiaToday How can we trust our families with BJP leadership during Covid epidermic when they think how to win elections? Where is the oxygen for our fellow citizens in Bangalore? Karnataka is a BJP ruled state. Where are the make shift hospitals? Where is the firewood to cremate the dead?", "When patients rush to the hospitals without BU number  hospitals refuse to admit. Do something in the software that BU number is generated quickly where ever test is done", "Death of people in #Chamarajanagar &amp; #Kalaburagi due to lack of oxygen-You can’t allow people to die because of oxygen shortage. Increase cap on supply to 1,792 M/T to #Karnataka or else we’ll issue directions to increase: #KHC tells GoI   @XpressBengaluru @santwana99 @PMOIndia", "Yes please stay cheerful, while you hearing one sad news after another , watch your country men gasping for oxygen but please be positive, don't be negative..   You opened my eyes @RajatSharmaLive", "@TapiocaChip Hey, any CT scan center for will do. Big hospitals like Apollo make teen corridors, I went to a big enough one but they said, just come. They are all expecting Covid+ only to come.", "@ttindia PL  postpone this temporarily and build good Hospital Infra in and around Delhi with adequate bed strength and Oxygen and Medical and Vaccination supply so that Delhi has a Proactive Health Policy than a Reactive scale of after the effect repair @harshvardan", ".@DHFWKA issues guidelines on rationale use of oxygen to ensure there is 0 wastage. @NewIndianXpress @XpressBengaluru @santwana99 @BBMPCOMM @WeAreBangalore @CovidKarnataka @NammaBengaluroo @NammaKarnataka_ @icindngr @IChangeMyCity @WFRising @namma_BTM @Namma_ORRCA @BAFBLR  https://t.co/phTwoeW31q", "@fortis_response @srlcare @fortis_hospital Sure Thanks. Will do it.", "@MotwaniSuhas @anubpattnaik Yes, abhi ke liye oxygen arrange hua, in a hospital. Thanks so much  https://t.co/ruZ6iRV2ws", "@tv9kannada @BSYBJP @CMofKarnataka @drashwathcn @mla_sudhakar @Tejasvi_Surya @BBMPCOMM @RAshokaBJP @DHFWKA @Captain_Mani72 @alokkumar6994 @nimmasuresh govt shld use present infra like military or PSU Hospitals n search for unused or left vacant hospital or under litigation for use of ppl", "@raghav_chadha AAPTards ka PR aur dramebazi khatam hone ke naam hi nahi leti 😶🙄  5 minute nahi hue abhi tak??  Bagair payment ke supplier kab tak Oxygen supply karega?  Testing payment rok diya.  😳😳 Chal kya raha hain?  Iss se accha management paan ka galle wala kar leta hain.  https://t.co/fFbRevbLn3", "And here we are educated people in cities struggling for Oxygen. Still time to learn and co exist.", "@Neurochauhan Sir is BU number mandatory if the patient is covid negative and he need to be admitted in hospital for treatment of phnemonia?", "Who is responsible for 24 lives lost in Chamarajanagar Dist. Hospital due to shortage of Oxygen?  Health minister @mla_sudhakar keep denying shortage of Oxygen, if these Deaths not due to Shortage of Oxygen, what is the reason?  Is there a Accountability or Not?  #ResignSudhakar", "@Tejasvi_Surya @Offtejasvisurya @Ravi_LA Vaccination process is pathetically managed, senior citizens and very old people had to stand in queue for 2 to 3 hrs to get token at Govt hospitals, after many has to return empty handed. Pls look into it"]}